apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k344_pinmux.h
/****************************************************************************
 * arch/arm/src/s32k3xx/hardware/s32k344_pinmux.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/* Copyright 2022 NXP */

#ifndef __ARCH_ARM_SRC_S32K3XX_HARDWARE_S32K344_PINMUX_H
#define __ARCH_ARM_SRC_S32K3XX_HARDWARE_S32K344_PINMUX_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <s32k3xx_pin.h>

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* In most cases, there are alternative configurations for various pins.
 * Those alternative pins are labeled with a suffix like _1, _2, etc. in
 * order to distinguish them.  Logic in the board.h file must select the
 * correct pin configuration for the board by defining a pin
 * configuration (with no suffix) that maps to the correct alternative.
 *
 * WARNING!!! WARNING!!! WARNING!!! WARNING!!! WARNING!!! WARNING!!!
 * Additional effort is required to select specific GPIO options such as
 * frequency, and pull-up/down!  Just the basics are defined for most pins
 * in the initial version of this file.
 */

/* Analog-to-Digital Converter (ADC)
 *
 * These are only outputs for external analog multiplexing.  Analog inputs
 * cannot be controlled by the pin multiplexing in the SIUL2 module.  Those
 * analog functions are available in parallel to the multiplexed digital
 * functionality.  See the S32K3xx reference manual for more information.
 */

#define PIN_ADC0_MA0_1              (PIN_PORTB | PIN3  | PIN_OUTPUT_ALT4)
#define PIN_ADC0_MA0_2              (PIN_PORTE | PIN2  | PIN_OUTPUT_ALT7)
#define PIN_ADC0_MA0_3              (PIN_PORTF | PIN9  | PIN_OUTPUT_ALT3)
#define PIN_ADC0_MA0_4              (PIN_PORTF | PIN12 | PIN_OUTPUT_ALT3)
#define PIN_ADC0_MA1_1              (PIN_PORTC | PIN14 | PIN_OUTPUT_ALT4)
#define PIN_ADC0_MA1_2              (PIN_PORTE | PIN6  | PIN_OUTPUT_ALT7)
#define PIN_ADC0_MA1_3              (PIN_PORTF | PIN10 | PIN_OUTPUT_ALT3)
#define PIN_ADC0_MA1_4              (PIN_PORTF | PIN13 | PIN_OUTPUT_ALT3)
#define PIN_ADC0_MA2_1              (PIN_PORTC | PIN6  | PIN_OUTPUT_ALT7)
#define PIN_ADC0_MA2_2              (PIN_PORTC | PIN15 | PIN_OUTPUT_ALT4)
#define PIN_ADC0_MA2_3              (PIN_PORTF | PIN11 | PIN_OUTPUT_ALT3)
#define PIN_ADC0_MA2_4              (PIN_PORTF | PIN19 | PIN_OUTPUT_ALT4)

#define PIN_ADC1_MA0_1              (PIN_PORTB | PIN2  | PIN_OUTPUT_ALT1)
#define PIN_ADC1_MA0_2              (PIN_PORTB | PIN23 | PIN_OUTPUT_ALT1)
#define PIN_ADC1_MA0_3              (PIN_PORTC | PIN27 | PIN_OUTPUT_ALT5)
#define PIN_ADC1_MA0_4              (PIN_PORTF | PIN16 | PIN_OUTPUT_ALT4)
#define PIN_ADC1_MA0_5              (PIN_PORTF | PIN29 | PIN_OUTPUT_ALT4)
#define PIN_ADC1_MA1_1              (PIN_PORTB | PIN24 | PIN_OUTPUT_ALT1)
#define PIN_ADC1_MA1_2              (PIN_PORTC | PIN13 | PIN_OUTPUT_ALT4)
#define PIN_ADC1_MA1_3              (PIN_PORTC | PIN21 | PIN_OUTPUT_ALT5)
#define PIN_ADC1_MA1_4              (PIN_PORTF | PIN17 | PIN_OUTPUT_ALT4)
#define PIN_ADC1_MA1_5              (PIN_PORTF | PIN30 | PIN_OUTPUT_ALT4)
#define PIN_ADC1_MA2_1              (PIN_PORTB | PIN28 | PIN_OUTPUT_ALT1)
#define PIN_ADC1_MA2_2              (PIN_PORTC | PIN12 | PIN_OUTPUT_ALT1)
#define PIN_ADC1_MA2_3              (PIN_PORTC | PIN20 | PIN_OUTPUT_ALT5)
#define PIN_ADC1_MA2_4              (PIN_PORTF | PIN18 | PIN_OUTPUT_ALT4)
#define PIN_ADC1_MA2_5              (PIN_PORTF | PIN31 | PIN_OUTPUT_ALT1)

/* FlexCAN */

#define PIN_CAN0_RX_1               (PIN_PORTA | PIN6  | PIN_INPUT_ALT2  | IMCR(512))
#define PIN_CAN0_RX_2               (PIN_PORTA | PIN28 | PIN_INPUT_ALT4  | IMCR(512))
#define PIN_CAN0_RX_3               (PIN_PORTB | PIN0  | PIN_INPUT_ALT3  | IMCR(512))
#define PIN_CAN0_RX_4               (PIN_PORTC | PIN2  | PIN_INPUT_ALT1  | IMCR(512))
#define PIN_CAN0_RX_5               (PIN_PORTF | PIN21 | PIN_INPUT_ALT5  | IMCR(512))
#define PIN_CAN0_TX_1               (PIN_PORTA | PIN7  | PIN_OUTPUT_ALT4)
#define PIN_CAN0_TX_2               (PIN_PORTA | PIN27 | PIN_OUTPUT_ALT5)
#define PIN_CAN0_TX_3               (PIN_PORTB | PIN1  | PIN_OUTPUT_ALT5)
#define PIN_CAN0_TX_4               (PIN_PORTC | PIN3  | PIN_OUTPUT_ALT3)
#define PIN_CAN0_TX_5               (PIN_PORTF | PIN20 | PIN_OUTPUT_ALT6)

#define PIN_CAN1_RX_1               (PIN_PORTA | PIN12 | PIN_INPUT_ALT2  | IMCR(513))
#define PIN_CAN1_RX_2               (PIN_PORTA | PIN22 | PIN_INPUT_ALT3  | IMCR(513))
#define PIN_CAN1_RX_3               (PIN_PORTB | PIN23 | PIN_INPUT_ALT4  | IMCR(513))
#define PIN_CAN1_RX_4               (PIN_PORTC | PIN9  | PIN_INPUT_ALT1  | IMCR(513))
#define PIN_CAN1_RX_5               (PIN_PORTF | PIN15 | PIN_INPUT_ALT5  | IMCR(513))
#define PIN_CAN1_TX_1               (PIN_PORTA | PIN11 | PIN_OUTPUT_ALT1)
#define PIN_CAN1_TX_2               (PIN_PORTA | PIN23 | PIN_OUTPUT_ALT1)
#define PIN_CAN1_TX_3               (PIN_PORTB | PIN22 | PIN_OUTPUT_ALT1)
#define PIN_CAN1_TX_4               (PIN_PORTC | PIN8  | PIN_OUTPUT_ALT3)
#define PIN_CAN1_TX_5               (PIN_PORTF | PIN14 | PIN_OUTPUT_ALT1)

