apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k344_pinmux.h
#define PIN_CAN2_RX_1               (PIN_PORTC | PIN6  | PIN_INPUT_ALT6  | IMCR(514))
#define PIN_CAN2_RX_2               (PIN_PORTC | PIN14 | PIN_INPUT_ALT2  | IMCR(514))
#define PIN_CAN2_RX_3               (PIN_PORTC | PIN16 | PIN_INPUT_ALT1  | IMCR(514))
#define PIN_CAN2_RX_4               (PIN_PORTD | PIN19 | PIN_INPUT_ALT4  | IMCR(514))
#define PIN_CAN2_RX_5               (PIN_PORTE | PIN25 | PIN_INPUT_ALT3  | IMCR(514))
#define PIN_CAN2_RX_6               (PIN_PORTF | PIN26 | PIN_INPUT_ALT5  | IMCR(514))
#define PIN_CAN2_TX_1               (PIN_PORTC | PIN7  | PIN_OUTPUT_ALT7)
#define PIN_CAN2_TX_2               (PIN_PORTC | PIN15 | PIN_OUTPUT_ALT1)
#define PIN_CAN2_TX_3               (PIN_PORTC | PIN17 | PIN_OUTPUT_ALT3)
#define PIN_CAN2_TX_4               (PIN_PORTD | PIN18 | PIN_OUTPUT_ALT1)
#define PIN_CAN2_TX_5               (PIN_PORTE | PIN24 | PIN_OUTPUT_ALT3)
#define PIN_CAN2_TX_6               (PIN_PORTF | PIN25 | PIN_OUTPUT_ALT1)

#define PIN_CAN3_RX_1               (PIN_PORTC | PIN1  | PIN_INPUT_ALT2  | IMCR(515))
#define PIN_CAN3_RX_2               (PIN_PORTC | PIN29 | PIN_INPUT_ALT3  | IMCR(515))
#define PIN_CAN3_RX_3               (PIN_PORTD | PIN15 | PIN_INPUT_ALT1  | IMCR(515))
#define PIN_CAN3_RX_4               (PIN_PORTE | PIN29 | PIN_INPUT_ALT4  | IMCR(515))
#define PIN_CAN3_RX_5               (PIN_PORTF | PIN30 | PIN_INPUT_ALT5  | IMCR(515))
#define PIN_CAN3_TX_1               (PIN_PORTC | PIN0  | PIN_OUTPUT_ALT1)
#define PIN_CAN3_TX_2               (PIN_PORTC | PIN28 | PIN_OUTPUT_ALT1)
#define PIN_CAN3_TX_3               (PIN_PORTE | PIN9  | PIN_OUTPUT_ALT4)
#define PIN_CAN3_TX_4               (PIN_PORTE | PIN28 | PIN_OUTPUT_ALT1)
#define PIN_CAN3_TX_5               (PIN_PORTF | PIN29 | PIN_OUTPUT_ALT1)

#define PIN_CAN4_RX_1               (PIN_PORTB | PIN2  | PIN_INPUT_ALT2  | IMCR(516))
#define PIN_CAN4_RX_2               (PIN_PORTC | PIN31 | PIN_INPUT_ALT3  | IMCR(516))
#define PIN_CAN4_RX_3               (PIN_PORTE | PIN14 | PIN_INPUT_ALT1  | IMCR(516))
#define PIN_CAN4_RX_4               (PIN_PORTE | PIN31 | PIN_INPUT_ALT4  | IMCR(516))
#define PIN_CAN4_RX_5               (PIN_PORTG | PIN9  | PIN_INPUT_ALT5  | IMCR(516))
#define PIN_CAN4_TX_1               (PIN_PORTB | PIN3  | PIN_OUTPUT_ALT5)
#define PIN_CAN4_TX_2               (PIN_PORTC | PIN30 | PIN_OUTPUT_ALT1)
#define PIN_CAN4_TX_3               (PIN_PORTE | PIN3  | PIN_OUTPUT_ALT1)
#define PIN_CAN4_TX_4               (PIN_PORTE | PIN30 | PIN_OUTPUT_ALT1)
#define PIN_CAN4_TX_5               (PIN_PORTG | PIN8  | PIN_OUTPUT_ALT1)

#define PIN_CAN5_RX_1               (PIN_PORTC | PIN11 | PIN_INPUT_ALT2  | IMCR(517))
#define PIN_CAN5_RX_2               (PIN_PORTC | PIN26 | PIN_INPUT_ALT5  | IMCR(517))
#define PIN_CAN5_RX_3               (PIN_PORTD | PIN17 | PIN_INPUT_ALT1  | IMCR(517))
#define PIN_CAN5_RX_4               (PIN_PORTF | PIN5  | PIN_INPUT_ALT3  | IMCR(517))
#define PIN_CAN5_RX_5               (PIN_PORTG | PIN14 | PIN_INPUT_ALT4  | IMCR(517))
#define PIN_CAN5_TX_1               (PIN_PORTC | PIN10 | PIN_OUTPUT_ALT3)
#define PIN_CAN5_TX_2               (PIN_PORTC | PIN27 | PIN_OUTPUT_ALT1)
#define PIN_CAN5_TX_3               (PIN_PORTE | PIN12 | PIN_OUTPUT_ALT2)
#define PIN_CAN5_TX_4               (PIN_PORTF | PIN4  | PIN_OUTPUT_ALT1)
#define PIN_CAN5_TX_5               (PIN_PORTG | PIN13 | PIN_OUTPUT_ALT1)

/* Clock Output (CLKOUT) */

#define PIN_CLKOUT_RUN_1            (PIN_PORTB | PIN5  | PIN_OUTPUT_ALT5)
#define PIN_CLKOUT_RUN_2            (PIN_PORTD | PIN10 | PIN_OUTPUT_ALT6)
#define PIN_CLKOUT_RUN_3            (PIN_PORTD | PIN14 | PIN_OUTPUT_ALT7)
#define PIN_CLKOUT_STANDBY_1        (PIN_PORTA | PIN12 | PIN_OUTPUT_ALT3)
#define PIN_CLKOUT_STANDBY_2        (PIN_PORTE | PIN10 | PIN_OUTPUT_ALT5)

/* Comparator (CMP)
 *
 * These are only digital comparator outputs.  The analog comparator inputs
 * cannot be controlled by the pin multiplexing in the SIUL2 module.  Those
 * analog functions are available in parallel to the multiplexed digital
 * functionality.  See the S32K3xx reference manual for more information.
 */

#define PIN_CMP0_OUT_1              (PIN_PORTA | PIN4  | PIN_OUTPUT_ALT4)
#define PIN_CMP0_OUT_2              (PIN_PORTE | PIN3  | PIN_OUTPUT_ALT7)
#define PIN_CMP0_OUT_3              (PIN_PORTF | PIN14 | PIN_OUTPUT_ALT3)
#define PIN_CMP0_RRT_1              (PIN_PORTA | PIN11 | PIN_OUTPUT_ALT5)
#define PIN_CMP0_RRT_2              (PIN_PORTD | PIN14 | PIN_OUTPUT_ALT6)
#define PIN_CMP0_RRT_3              (PIN_PORTF | PIN15 | PIN_OUTPUT_ALT3)

#define PIN_CMP1_OUT_1              (PIN_PORTA | PIN12 | PIN_OUTPUT_ALT7)
#define PIN_CMP1_OUT_2              (PIN_PORTE | PIN30 | PIN_OUTPUT_ALT2)
#define PIN_CMP1_RRT_1              (PIN_PORTE | PIN15 | PIN_OUTPUT_ALT5)
#define PIN_CMP1_RRT_2              (PIN_PORTE | PIN31 | PIN_OUTPUT_ALT2)

#define PIN_CMP2_OUT_1              (PIN_PORTA | PIN9  | PIN_OUTPUT_ALT7)
#define PIN_CMP2_OUT_2              (PIN_PORTG | PIN4  | PIN_OUTPUT_ALT4)
#define PIN_CMP2_RRT_1              (PIN_PORTC | PIN5  | PIN_OUTPUT_ALT5)
#define PIN_CMP2_RRT_2              (PIN_PORTG | PIN5  | PIN_OUTPUT_ALT4)

/* External Interrupt (EIRQ) */

#define PIN_EIRQ0_1                 (PIN_PORTA | PIN0  | PIN_INPUT_ALT1  | IMCR(528))
#define PIN_EIRQ0_2                 (PIN_PORTA | PIN18 | PIN_INPUT_ALT2  | IMCR(528))
#define PIN_EIRQ0_3                 (PIN_PORTC | PIN0  | PIN_INPUT_ALT3  | IMCR(528))
#define PIN_EIRQ0_4                 (PIN_PORTE | PIN0  | PIN_INPUT_ALT4  | IMCR(528))
#define PIN_EIRQ0_5                 (PIN_PORTF | PIN0  | PIN_INPUT_ALT5  | IMCR(528))
#define PIN_EIRQ1_1                 (PIN_PORTA | PIN1  | PIN_INPUT_ALT1  | IMCR(529))
#define PIN_EIRQ1_2                 (PIN_PORTA | PIN19 | PIN_INPUT_ALT2  | IMCR(529))
#define PIN_EIRQ1_3                 (PIN_PORTC | PIN1  | PIN_INPUT_ALT3  | IMCR(529))
#define PIN_EIRQ1_4                 (PIN_PORTE | PIN1  | PIN_INPUT_ALT4  | IMCR(529))
#define PIN_EIRQ1_5                 (PIN_PORTF | PIN1  | PIN_INPUT_ALT5  | IMCR(529))
#define PIN_EIRQ2_1                 (PIN_PORTA | PIN2  | PIN_INPUT_ALT1  | IMCR(530))
#define PIN_EIRQ2_2                 (PIN_PORTA | PIN20 | PIN_INPUT_ALT2  | IMCR(530))
#define PIN_EIRQ2_3                 (PIN_PORTC | PIN2  | PIN_INPUT_ALT3  | IMCR(530))
#define PIN_EIRQ2_4                 (PIN_PORTE | PIN2  | PIN_INPUT_ALT4  | IMCR(530))
#define PIN_EIRQ2_5                 (PIN_PORTF | PIN2  | PIN_INPUT_ALT5  | IMCR(530))
#define PIN_EIRQ3_1                 (PIN_PORTA | PIN3  | PIN_INPUT_ALT1  | IMCR(531))
#define PIN_EIRQ3_2                 (PIN_PORTA | PIN21 | PIN_INPUT_ALT2  | IMCR(531))
#define PIN_EIRQ3_3                 (PIN_PORTC | PIN3  | PIN_INPUT_ALT3  | IMCR(531))
#define PIN_EIRQ3_4                 (PIN_PORTE | PIN3  | PIN_INPUT_ALT4  | IMCR(531))
#define PIN_EIRQ3_5                 (PIN_PORTF | PIN3  | PIN_INPUT_ALT5  | IMCR(531))
#define PIN_EIRQ4_1                 (PIN_PORTA | PIN4  | PIN_INPUT_ALT1  | IMCR(532))
#define PIN_EIRQ4_2                 (PIN_PORTA | PIN16 | PIN_INPUT_ALT2  | IMCR(532))
#define PIN_EIRQ4_3                 (PIN_PORTC | PIN4  | PIN_INPUT_ALT3  | IMCR(532))
#define PIN_EIRQ4_4                 (PIN_PORTE | PIN4  | PIN_INPUT_ALT4  | IMCR(532))
#define PIN_EIRQ4_5                 (PIN_PORTF | PIN4  | PIN_INPUT_ALT5  | IMCR(532))
#define PIN_EIRQ5_1                 (PIN_PORTA | PIN5  | PIN_INPUT_ALT1  | IMCR(533))
#define PIN_EIRQ5_2                 (PIN_PORTA | PIN25 | PIN_INPUT_ALT2  | IMCR(533))
#define PIN_EIRQ5_3                 (PIN_PORTC | PIN5  | PIN_INPUT_ALT3  | IMCR(533))
#define PIN_EIRQ5_4                 (PIN_PORTE | PIN5  | PIN_INPUT_ALT4  | IMCR(533))
#define PIN_EIRQ5_5                 (PIN_PORTF | PIN5  | PIN_INPUT_ALT5  | IMCR(533))
#define PIN_EIRQ6_1                 (PIN_PORTA | PIN6  | PIN_INPUT_ALT1  | IMCR(534))
#define PIN_EIRQ6_2                 (PIN_PORTA | PIN28 | PIN_INPUT_ALT2  | IMCR(534))
#define PIN_EIRQ6_3                 (PIN_PORTC | PIN6  | PIN_INPUT_ALT3  | IMCR(534))
#define PIN_EIRQ6_4                 (PIN_PORTE | PIN6  | PIN_INPUT_ALT4  | IMCR(534))
#define PIN_EIRQ6_5                 (PIN_PORTF | PIN6  | PIN_INPUT_ALT5  | IMCR(534))
#define PIN_EIRQ7_1                 (PIN_PORTA | PIN7  | PIN_INPUT_ALT1  | IMCR(535))
#define PIN_EIRQ7_2                 (PIN_PORTA | PIN30 | PIN_INPUT_ALT2  | IMCR(535))
#define PIN_EIRQ7_3                 (PIN_PORTC | PIN7  | PIN_INPUT_ALT3  | IMCR(535))
#define PIN_EIRQ7_4                 (PIN_PORTE | PIN8  | PIN_INPUT_ALT4  | IMCR(535))
#define PIN_EIRQ7_5                 (PIN_PORTF | PIN7  | PIN_INPUT_ALT5  | IMCR(535))
#define PIN_EIRQ8_1                 (PIN_PORTB | PIN0  | PIN_INPUT_ALT1  | IMCR(536))
#define PIN_EIRQ8_2                 (PIN_PORTB | PIN21 | PIN_INPUT_ALT2  | IMCR(536))
#define PIN_EIRQ8_3                 (PIN_PORTD | PIN0  | PIN_INPUT_ALT3  | IMCR(536))
#define PIN_EIRQ8_4                 (PIN_PORTE | PIN9  | PIN_INPUT_ALT4  | IMCR(536))
#define PIN_EIRQ8_5                 (PIN_PORTG | PIN0  | PIN_INPUT_ALT5  | IMCR(536))
#define PIN_EIRQ9_1                 (PIN_PORTB | PIN1  | PIN_INPUT_ALT1  | IMCR(537))
#define PIN_EIRQ9_2                 (PIN_PORTB | PIN22 | PIN_INPUT_ALT2  | IMCR(537))
#define PIN_EIRQ9_3                 (PIN_PORTD | PIN1  | PIN_INPUT_ALT3  | IMCR(537))
#define PIN_EIRQ9_4                 (PIN_PORTE | PIN10 | PIN_INPUT_ALT4  | IMCR(537))
#define PIN_EIRQ9_5                 (PIN_PORTG | PIN1  | PIN_INPUT_ALT5  | IMCR(537))
#define PIN_EIRQ10_1                (PIN_PORTB | PIN2  | PIN_INPUT_ALT1  | IMCR(538))
#define PIN_EIRQ10_2                (PIN_PORTB | PIN23 | PIN_INPUT_ALT2  | IMCR(538))
#define PIN_EIRQ10_3                (PIN_PORTD | PIN2  | PIN_INPUT_ALT3  | IMCR(538))
#define PIN_EIRQ10_4                (PIN_PORTE | PIN11 | PIN_INPUT_ALT4  | IMCR(538))
#define PIN_EIRQ10_5                (PIN_PORTG | PIN2  | PIN_INPUT_ALT5  | IMCR(538))
#define PIN_EIRQ11_1                (PIN_PORTB | PIN3  | PIN_INPUT_ALT1  | IMCR(539))
#define PIN_EIRQ11_2                (PIN_PORTB | PIN24 | PIN_INPUT_ALT2  | IMCR(539))
#define PIN_EIRQ11_3                (PIN_PORTD | PIN3  | PIN_INPUT_ALT3  | IMCR(539))
#define PIN_EIRQ11_4                (PIN_PORTE | PIN12 | PIN_INPUT_ALT4  | IMCR(539))
#define PIN_EIRQ11_5                (PIN_PORTG | PIN3  | PIN_INPUT_ALT5  | IMCR(539))
#define PIN_EIRQ12_1                (PIN_PORTB | PIN4  | PIN_INPUT_ALT1  | IMCR(540))
#define PIN_EIRQ12_2                (PIN_PORTB | PIN25 | PIN_INPUT_ALT2  | IMCR(540))
#define PIN_EIRQ12_3                (PIN_PORTD | PIN4  | PIN_INPUT_ALT3  | IMCR(540))
#define PIN_EIRQ12_4                (PIN_PORTE | PIN13 | PIN_INPUT_ALT4  | IMCR(540))
#define PIN_EIRQ12_5                (PIN_PORTG | PIN4  | PIN_INPUT_ALT5  | IMCR(540))
#define PIN_EIRQ13_1                (PIN_PORTB | PIN5  | PIN_INPUT_ALT1  | IMCR(541))
#define PIN_EIRQ13_2                (PIN_PORTB | PIN26 | PIN_INPUT_ALT2  | IMCR(541))
#define PIN_EIRQ13_3                (PIN_PORTD | PIN5  | PIN_INPUT_ALT3  | IMCR(541))
#define PIN_EIRQ13_4                (PIN_PORTE | PIN14 | PIN_INPUT_ALT4  | IMCR(541))
#define PIN_EIRQ13_5                (PIN_PORTG | PIN5  | PIN_INPUT_ALT5  | IMCR(541))
#define PIN_EIRQ14_1                (PIN_PORTB | PIN8  | PIN_INPUT_ALT1  | IMCR(542))
#define PIN_EIRQ14_2                (PIN_PORTB | PIN28 | PIN_INPUT_ALT2  | IMCR(542))
#define PIN_EIRQ14_3                (PIN_PORTD | PIN6  | PIN_INPUT_ALT3  | IMCR(542))
#define PIN_EIRQ14_4                (PIN_PORTE | PIN15 | PIN_INPUT_ALT4  | IMCR(542))
#define PIN_EIRQ14_5                (PIN_PORTG | PIN6  | PIN_INPUT_ALT5  | IMCR(542))
#define PIN_EIRQ15_1                (PIN_PORTB | PIN9  | PIN_INPUT_ALT1  | IMCR(543))
#define PIN_EIRQ15_2                (PIN_PORTB | PIN31 | PIN_INPUT_ALT2  | IMCR(543))
#define PIN_EIRQ15_3                (PIN_PORTD | PIN7  | PIN_INPUT_ALT3  | IMCR(543))
#define PIN_EIRQ15_4                (PIN_PORTE | PIN16 | PIN_INPUT_ALT4  | IMCR(543))
#define PIN_EIRQ15_5                (PIN_PORTG | PIN7  | PIN_INPUT_ALT5  | IMCR(543))
#define PIN_EIRQ16_1                (PIN_PORTA | PIN8  | PIN_INPUT_ALT1  | IMCR(544))
#define PIN_EIRQ16_2                (PIN_PORTC | PIN8  | PIN_INPUT_ALT2  | IMCR(544))
#define PIN_EIRQ16_3                (PIN_PORTC | PIN20 | PIN_INPUT_ALT3  | IMCR(544))
#define PIN_EIRQ16_4                (PIN_PORTF | PIN8  | PIN_INPUT_ALT4  | IMCR(544))
#define PIN_EIRQ17_1                (PIN_PORTA | PIN9  | PIN_INPUT_ALT1  | IMCR(545))
#define PIN_EIRQ17_2                (PIN_PORTC | PIN9  | PIN_INPUT_ALT2  | IMCR(545))
#define PIN_EIRQ17_3                (PIN_PORTC | PIN21 | PIN_INPUT_ALT3  | IMCR(545))
#define PIN_EIRQ17_4                (PIN_PORTF | PIN9  | PIN_INPUT_ALT4  | IMCR(545))
#define PIN_EIRQ18_1                (PIN_PORTA | PIN10 | PIN_INPUT_ALT1  | IMCR(546))
#define PIN_EIRQ18_2                (PIN_PORTC | PIN10 | PIN_INPUT_ALT2  | IMCR(546))
#define PIN_EIRQ18_3                (PIN_PORTC | PIN23 | PIN_INPUT_ALT3  | IMCR(546))
#define PIN_EIRQ18_4                (PIN_PORTF | PIN10 | PIN_INPUT_ALT4  | IMCR(546))
#define PIN_EIRQ19_1                (PIN_PORTA | PIN11 | PIN_INPUT_ALT1  | IMCR(547))
#define PIN_EIRQ19_2                (PIN_PORTC | PIN11 | PIN_INPUT_ALT2  | IMCR(547))
#define PIN_EIRQ19_3                (PIN_PORTC | PIN24 | PIN_INPUT_ALT3  | IMCR(547))
#define PIN_EIRQ19_4                (PIN_PORTF | PIN11 | PIN_INPUT_ALT4  | IMCR(547))
#define PIN_EIRQ20_1                (PIN_PORTA | PIN12 | PIN_INPUT_ALT1  | IMCR(548))
#define PIN_EIRQ20_2                (PIN_PORTC | PIN12 | PIN_INPUT_ALT2  | IMCR(548))
#define PIN_EIRQ20_3                (PIN_PORTC | PIN25 | PIN_INPUT_ALT3  | IMCR(548))
#define PIN_EIRQ20_4                (PIN_PORTF | PIN12 | PIN_INPUT_ALT4  | IMCR(548))
#define PIN_EIRQ21_1                (PIN_PORTA | PIN13 | PIN_INPUT_ALT1  | IMCR(549))
#define PIN_EIRQ21_2                (PIN_PORTC | PIN13 | PIN_INPUT_ALT2  | IMCR(549))
#define PIN_EIRQ21_3                (PIN_PORTC | PIN26 | PIN_INPUT_ALT3  | IMCR(549))
#define PIN_EIRQ21_4                (PIN_PORTF | PIN13 | PIN_INPUT_ALT4  | IMCR(549))
#define PIN_EIRQ22_1                (PIN_PORTA | PIN14 | PIN_INPUT_ALT1  | IMCR(550))
#define PIN_EIRQ22_2                (PIN_PORTC | PIN14 | PIN_INPUT_ALT2  | IMCR(550))
#define PIN_EIRQ22_3                (PIN_PORTC | PIN27 | PIN_INPUT_ALT3  | IMCR(550))
#define PIN_EIRQ22_4                (PIN_PORTF | PIN14 | PIN_INPUT_ALT4  | IMCR(550))
#define PIN_EIRQ23_1                (PIN_PORTA | PIN15 | PIN_INPUT_ALT1  | IMCR(551))
#define PIN_EIRQ23_2                (PIN_PORTC | PIN15 | PIN_INPUT_ALT2  | IMCR(551))
#define PIN_EIRQ23_3                (PIN_PORTC | PIN29 | PIN_INPUT_ALT3  | IMCR(551))
#define PIN_EIRQ23_4                (PIN_PORTF | PIN15 | PIN_INPUT_ALT4  | IMCR(551))
#define PIN_EIRQ24_1                (PIN_PORTB | PIN10 | PIN_INPUT_ALT1  | IMCR(552))
#define PIN_EIRQ24_2                (PIN_PORTD | PIN8  | PIN_INPUT_ALT2  | IMCR(552))
#define PIN_EIRQ24_3                (PIN_PORTD | PIN17 | PIN_INPUT_ALT3  | IMCR(552))
#define PIN_EIRQ24_4                (PIN_PORTG | PIN8  | PIN_INPUT_ALT4  | IMCR(552))
#define PIN_EIRQ25_1                (PIN_PORTB | PIN11 | PIN_INPUT_ALT1  | IMCR(553))
#define PIN_EIRQ25_2                (PIN_PORTD | PIN9  | PIN_INPUT_ALT2  | IMCR(553))
#define PIN_EIRQ25_3                (PIN_PORTD | PIN20 | PIN_INPUT_ALT3  | IMCR(553))
#define PIN_EIRQ25_4                (PIN_PORTG | PIN9  | PIN_INPUT_ALT4  | IMCR(553))
#define PIN_EIRQ26_1                (PIN_PORTB | PIN12 | PIN_INPUT_ALT1  | IMCR(554))
#define PIN_EIRQ26_2                (PIN_PORTD | PIN10 | PIN_INPUT_ALT2  | IMCR(554))
#define PIN_EIRQ26_3                (PIN_PORTD | PIN21 | PIN_INPUT_ALT3  | IMCR(554))
#define PIN_EIRQ26_4                (PIN_PORTG | PIN10 | PIN_INPUT_ALT4  | IMCR(554))
#define PIN_EIRQ27_1                (PIN_PORTB | PIN13 | PIN_INPUT_ALT1  | IMCR(555))
#define PIN_EIRQ27_2                (PIN_PORTD | PIN11 | PIN_INPUT_ALT2  | IMCR(555))
#define PIN_EIRQ27_3                (PIN_PORTD | PIN22 | PIN_INPUT_ALT3  | IMCR(555))
#define PIN_EIRQ27_4                (PIN_PORTG | PIN11 | PIN_INPUT_ALT4  | IMCR(555))
#define PIN_EIRQ28_1                (PIN_PORTB | PIN14 | PIN_INPUT_ALT1  | IMCR(556))
#define PIN_EIRQ28_2                (PIN_PORTD | PIN12 | PIN_INPUT_ALT2  | IMCR(556))
#define PIN_EIRQ28_3                (PIN_PORTD | PIN23 | PIN_INPUT_ALT3  | IMCR(556))
#define PIN_EIRQ28_4                (PIN_PORTG | PIN12 | PIN_INPUT_ALT4  | IMCR(556))
#define PIN_EIRQ29_1                (PIN_PORTB | PIN15 | PIN_INPUT_ALT1  | IMCR(557))
#define PIN_EIRQ29_2                (PIN_PORTD | PIN13 | PIN_INPUT_ALT2  | IMCR(557))
#define PIN_EIRQ29_3                (PIN_PORTD | PIN24 | PIN_INPUT_ALT3  | IMCR(557))
#define PIN_EIRQ29_4                (PIN_PORTG | PIN13 | PIN_INPUT_ALT4  | IMCR(557))
#define PIN_EIRQ30_1                (PIN_PORTB | PIN16 | PIN_INPUT_ALT1  | IMCR(558))
#define PIN_EIRQ30_2                (PIN_PORTD | PIN14 | PIN_INPUT_ALT3  | IMCR(558))
#define PIN_EIRQ30_3                (PIN_PORTD | PIN27 | PIN_INPUT_ALT2  | IMCR(558))
#define PIN_EIRQ30_4                (PIN_PORTG | PIN14 | PIN_INPUT_ALT4  | IMCR(558))
#define PIN_EIRQ31_1                (PIN_PORTB | PIN17 | PIN_INPUT_ALT1  | IMCR(559))
#define PIN_EIRQ31_2                (PIN_PORTD | PIN15 | PIN_INPUT_ALT2  | IMCR(559))
#define PIN_EIRQ31_3                (PIN_PORTD | PIN28 | PIN_INPUT_ALT3  | IMCR(559))
#define PIN_EIRQ31_4                (PIN_PORTG | PIN15 | PIN_INPUT_ALT4  | IMCR(559))

