apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k344_pinmux.h
/* Ethernet MAC (EMAC) */

#define PIN_EMAC_MII_COL_1          (PIN_PORTB | PIN23 | PIN_INPUT_ALT1  | IMCR(801))
#define PIN_EMAC_MII_COL_2          (PIN_PORTC | PIN14 | PIN_INPUT_ALT2  | IMCR(801))
#define PIN_EMAC_MII_CRS_1          (PIN_PORTB | PIN22 | PIN_INPUT_ALT1  | IMCR(802))
#define PIN_EMAC_MII_CRS_2          (PIN_PORTC | PIN15 | PIN_INPUT_ALT2  | IMCR(802))
#define PIN_EMAC_MII_RMII_MDC_1     (PIN_PORTB | PIN5  | PIN_OUTPUT_ALT7)
#define PIN_EMAC_MII_RMII_MDC_2     (PIN_PORTD | PIN17 | PIN_OUTPUT_ALT3)
#define PIN_EMAC_MII_RMII_MDC_3     (PIN_PORTE | PIN8  | PIN_OUTPUT_ALT5)
#define PIN_EMAC_MII_RMII_MDIO_1    (PIN_PORTB | PIN4  | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT1  | IMCR(803))
#define PIN_EMAC_MII_RMII_MDIO_2    (PIN_PORTD | PIN16 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT2  | IMCR(803))
#define PIN_EMAC_MII_RMII_RX_DV_1   (PIN_PORTC | PIN15 | PIN_INPUT_ALT2  | IMCR(804))
#define PIN_EMAC_MII_RMII_RX_DV_2   (PIN_PORTC | PIN17 | PIN_INPUT_ALT1  | IMCR(804))
#define PIN_EMAC_MII_RMII_RX_ER_1   (PIN_PORTC | PIN14 | PIN_INPUT_ALT2  | IMCR(805))
#define PIN_EMAC_MII_RMII_RX_ER_2   (PIN_PORTC | PIN16 | PIN_INPUT_ALT1  | IMCR(805))
#define PIN_EMAC_MII_RMII_RXD0_1    (PIN_PORTC | PIN0  | PIN_INPUT_ALT2  | IMCR(806))
#define PIN_EMAC_MII_RMII_RXD0_2    (PIN_PORTC | PIN1  | PIN_INPUT_ALT1  | IMCR(806))
#define PIN_EMAC_MII_RMII_RXD0_3    (PIN_PORTD | PIN9  | PIN_INPUT_ALT3  | IMCR(806))
#define PIN_EMAC_MII_RMII_RXD1_1    (PIN_PORTC | PIN0  | PIN_INPUT_ALT1  | IMCR(807))
#define PIN_EMAC_MII_RMII_RXD1_2    (PIN_PORTC | PIN1  | PIN_INPUT_ALT2  | IMCR(807))
#define PIN_EMAC_MII_RMII_RXD1_3    (PIN_PORTD | PIN8  | PIN_INPUT_ALT3  | IMCR(807))
#define PIN_EMAC_MII_RMII_TX_CLK_1  (PIN_PORTC | PIN0  | PIN_INPUT_ALT4  | IMCR(808))
#define PIN_EMAC_MII_RMII_TX_CLK_2  (PIN_PORTD | PIN6  | PIN_INPUT_ALT2  | IMCR(808))
#define PIN_EMAC_MII_RMII_TX_CLK_3  (PIN_PORTD | PIN11 | PIN_INPUT_ALT1  | IMCR(808))
#define PIN_EMAC_MII_RMII_TX_CLK_4  (PIN_PORTD | PIN12 | PIN_INPUT_ALT3  | IMCR(808))
#define PIN_EMAC_MII_RMII_TX_EN_1   (PIN_PORTD | PIN11 | PIN_OUTPUT_ALT3)
#define PIN_EMAC_MII_RMII_TX_EN_2   (PIN_PORTD | PIN12 | PIN_OUTPUT_ALT5)
#define PIN_EMAC_MII_RMII_TX_EN_3   (PIN_PORTE | PIN9  | PIN_OUTPUT_ALT6)
#define PIN_EMAC_MII_RMII_TXD0_1    (PIN_PORTB | PIN5  | PIN_OUTPUT_ALT1)
#define PIN_EMAC_MII_RMII_TXD0_2    (PIN_PORTC | PIN2  | PIN_OUTPUT_ALT5)
#define PIN_EMAC_MII_RMII_TXD0_3    (PIN_PORTD | PIN7  | PIN_OUTPUT_ALT1)
#define PIN_EMAC_MII_RMII_TXD1_1    (PIN_PORTB | PIN4  | PIN_OUTPUT_ALT1)
#define PIN_EMAC_MII_RMII_TXD1_2    (PIN_PORTC | PIN2  | PIN_OUTPUT_ALT1)
#define PIN_EMAC_MII_RMII_TXD1_3    (PIN_PORTD | PIN7  | PIN_OUTPUT_ALT5)
#define PIN_EMAC_MII_RX_CLK_1       (PIN_PORTC | PIN1  | PIN_INPUT_ALT3  | IMCR(812))
#define PIN_EMAC_MII_RX_CLK_2       (PIN_PORTD | PIN5  | PIN_INPUT_ALT2  | IMCR(812))
#define PIN_EMAC_MII_RX_CLK_3       (PIN_PORTD | PIN10 | PIN_INPUT_ALT1  | IMCR(812))
#define PIN_EMAC_MII_RXD2_1         (PIN_PORTC | PIN15 | PIN_INPUT_ALT2  | IMCR(813))
#define PIN_EMAC_MII_RXD2_2         (PIN_PORTD | PIN9  | PIN_INPUT_ALT1  | IMCR(813))
#define PIN_EMAC_MII_RXD3_1         (PIN_PORTC | PIN14 | PIN_INPUT_ALT2  | IMCR(814))
#define PIN_EMAC_MII_RXD3_2         (PIN_PORTD | PIN8  | PIN_INPUT_ALT1  | IMCR(814))
#define PIN_EMAC_MII_TXD2_1         (PIN_PORTD | PIN5  | PIN_OUTPUT_ALT1)
#define PIN_EMAC_MII_TXD2_2         (PIN_PORTD | PIN6  | PIN_OUTPUT_ALT5)
#define PIN_EMAC_MII_TXD2_3         (PIN_PORTD | PIN11 | PIN_OUTPUT_ALT1)
#define PIN_EMAC_MII_TXD3_1         (PIN_PORTD | PIN5  | PIN_OUTPUT_ALT5)
#define PIN_EMAC_MII_TXD3_2         (PIN_PORTD | PIN6  | PIN_OUTPUT_ALT1)
#define PIN_EMAC_MII_TXD3_3         (PIN_PORTD | PIN10 | PIN_OUTPUT_ALT1)
#define PIN_EMAC_PPS0_1             (PIN_PORTA | PIN26 | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT3  | IMCR(656))
#define PIN_EMAC_PPS0_2             (PIN_PORTD | PIN14 | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT2  | IMCR(656))
#define PIN_EMAC_PPS0_3             (PIN_PORTE | PIN3  | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT1  | IMCR(656))
#define PIN_EMAC_PPS1_1             (PIN_PORTA | PIN27 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT3  | IMCR(657))
#define PIN_EMAC_PPS1_2             (PIN_PORTD | PIN13 | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT2  | IMCR(657))
#define PIN_EMAC_PPS1_3             (PIN_PORTE | PIN14 | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT1  | IMCR(657))
#define PIN_EMAC_PPS2_1             (PIN_PORTA | PIN29 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT3  | IMCR(658))
#define PIN_EMAC_PPS2_2             (PIN_PORTD | PIN15 | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT2  | IMCR(658))
#define PIN_EMAC_PPS2_3             (PIN_PORTD | PIN17 | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT1  | IMCR(658))
#define PIN_EMAC_PPS3_1             (PIN_PORTB | PIN28 | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT2  | IMCR(659))
#define PIN_EMAC_PPS3_2             (PIN_PORTE | PIN9  | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT1  | IMCR(659))
#define PIN_EMAC_PPS3_3             (PIN_PORTE | PIN12 | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT3  | IMCR(659))

/* Enhanced Modular I/O Subsystem (eMIOS) */

#define PIN_EMIOS0_CH0_1            (PIN_PORTB | PIN12 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(560))
#define PIN_EMIOS0_CH0_2            (PIN_PORTC | PIN0  | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT3  | IMCR(560))
#define PIN_EMIOS0_CH0_3            (PIN_PORTD | PIN15 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT2  | IMCR(560))
#define PIN_EMIOS0_CH1_1            (PIN_PORTB | PIN13 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT2  | IMCR(561))
#define PIN_EMIOS0_CH1_2            (PIN_PORTC | PIN1  | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(561))
#define PIN_EMIOS0_CH1_3            (PIN_PORTD | PIN16 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT3  | IMCR(561))
#define PIN_EMIOS0_CH1_4            (PIN_PORTE | PIN11 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT4  | IMCR(561))
#define PIN_EMIOS0_CH2_1            (PIN_PORTB | PIN14 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT3  | IMCR(562))
#define PIN_EMIOS0_CH2_2            (PIN_PORTC | PIN2  | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT2  | IMCR(562))
#define PIN_EMIOS0_CH2_3            (PIN_PORTD | PIN0  | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(562))
#define PIN_EMIOS0_CH2_4            (PIN_PORTD | PIN5  | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT4  | IMCR(562))
#define PIN_EMIOS0_CH3_1            (PIN_PORTB | PIN0  | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT4  | IMCR(563))
#define PIN_EMIOS0_CH3_2            (PIN_PORTB | PIN15 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(563))
#define PIN_EMIOS0_CH3_3            (PIN_PORTC | PIN3  | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT3  | IMCR(563))
#define PIN_EMIOS0_CH3_4            (PIN_PORTD | PIN1  | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT2  | IMCR(563))
#define PIN_EMIOS0_CH3_5            (PIN_PORTE | PIN2  | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT5  | IMCR(563))
#define PIN_EMIOS0_CH4_1            (PIN_PORTB | PIN4  | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(564))
#define PIN_EMIOS0_CH4_2            (PIN_PORTB | PIN16 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT2  | IMCR(564))
#define PIN_EMIOS0_CH5_1            (PIN_PORTB | PIN5  | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(565))
#define PIN_EMIOS0_CH5_2            (PIN_PORTB | PIN17 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT2  | IMCR(565))
#define PIN_EMIOS0_CH6_1            (PIN_PORTA | PIN17 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT2  | IMCR(566))
#define PIN_EMIOS0_CH6_2            (PIN_PORTC | PIN10 | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT4  | IMCR(566))
#define PIN_EMIOS0_CH6_3            (PIN_PORTE | PIN8  | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(566))
#define PIN_EMIOS0_CH7_1            (PIN_PORTB | PIN1  | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT3  | IMCR(567))
#define PIN_EMIOS0_CH7_2            (PIN_PORTE | PIN7  | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT2  | IMCR(567))
#define PIN_EMIOS0_CH7_3            (PIN_PORTE | PIN9  | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(567))
#define PIN_EMIOS0_CH8_1            (PIN_PORTB | PIN2  | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(568))
#define PIN_EMIOS0_CH8_2            (PIN_PORTC | PIN4  | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT2  | IMCR(568))
#define PIN_EMIOS0_CH8_3            (PIN_PORTC | PIN22 | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT3  | IMCR(568))
#define PIN_EMIOS0_CH9_1            (PIN_PORTA | PIN1  | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(569))
#define PIN_EMIOS0_CH9_2            (PIN_PORTB | PIN3  | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT2  | IMCR(569))
#define PIN_EMIOS0_CH10_1           (PIN_PORTA | PIN15 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT2  | IMCR(570))
#define PIN_EMIOS0_CH10_2           (PIN_PORTC | PIN14 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(570))
#define PIN_EMIOS0_CH11_1           (PIN_PORTA | PIN16 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT2  | IMCR(571))
#define PIN_EMIOS0_CH11_2           (PIN_PORTC | PIN15 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(571))
#define PIN_EMIOS0_CH12_1           (PIN_PORTA | PIN10 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT2  | IMCR(572))
#define PIN_EMIOS0_CH12_2           (PIN_PORTD | PIN8  | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT1  | IMCR(572))
#define PIN_EMIOS0_CH13_1           (PIN_PORTA | PIN11 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(573))
#define PIN_EMIOS0_CH13_2           (PIN_PORTD | PIN9  | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT2  | IMCR(573))
#define PIN_EMIOS0_CH14_1           (PIN_PORTA | PIN12 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(574))
#define PIN_EMIOS0_CH14_2           (PIN_PORTC | PIN0  | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT2  | IMCR(574))
#define PIN_EMIOS0_CH15_1           (PIN_PORTA | PIN13 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT2  | IMCR(575))
#define PIN_EMIOS0_CH15_2           (PIN_PORTC | PIN1  | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT1  | IMCR(575))
#define PIN_EMIOS0_CH16_1           (PIN_PORTC | PIN5  | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT2  | IMCR(576))
#define PIN_EMIOS0_CH16_2           (PIN_PORTD | PIN0  | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT1  | IMCR(576))
#define PIN_EMIOS0_CH16_3           (PIN_PORTD | PIN10 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT3  | IMCR(576))
#define PIN_EMIOS0_CH17_1           (PIN_PORTA | PIN0  | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT2  | IMCR(577))
#define PIN_EMIOS0_CH17_2           (PIN_PORTD | PIN1  | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT1  | IMCR(577))
#define PIN_EMIOS0_CH17_3           (PIN_PORTD | PIN11 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT3  | IMCR(577))
#define PIN_EMIOS0_CH18_1           (PIN_PORTD | PIN12 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(578))
#define PIN_EMIOS0_CH18_2           (PIN_PORTD | PIN17 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT3  | IMCR(578))
#define PIN_EMIOS0_CH18_3           (PIN_PORTE | PIN4  | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT2  | IMCR(578))
#define PIN_EMIOS0_CH19_1           (PIN_PORTD | PIN5  | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT2  | IMCR(579))
#define PIN_EMIOS0_CH19_2           (PIN_PORTE | PIN3  | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT4  | IMCR(579))
#define PIN_EMIOS0_CH19_3           (PIN_PORTE | PIN5  | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT1  | IMCR(579))
#define PIN_EMIOS0_CH19_4           (PIN_PORTE | PIN14 | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT3  | IMCR(579))
#define PIN_EMIOS0_CH20_1           (PIN_PORTD | PIN13 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(580))
#define PIN_EMIOS0_CH20_2           (PIN_PORTE | PIN10 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT2  | IMCR(580))
#define PIN_EMIOS0_CH21_1           (PIN_PORTD | PIN14 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(581))
#define PIN_EMIOS0_CH21_2           (PIN_PORTE | PIN11 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT2  | IMCR(581))
#define PIN_EMIOS0_CH22_1           (PIN_PORTC | PIN12 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT2  | IMCR(582))
#define PIN_EMIOS0_CH22_2           (PIN_PORTE | PIN15 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT1  | IMCR(582))
#define PIN_EMIOS0_CH22_3           (PIN_PORTE | PIN19 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT3  | IMCR(582))
#define PIN_EMIOS0_CH23_1           (PIN_PORTC | PIN13 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT1  | IMCR(583))
#define PIN_EMIOS0_CH23_2           (PIN_PORTE | PIN16 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT2  | IMCR(583))

#define PIN_EMIOS1_CH0_1            (PIN_PORTA | PIN0  | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT3  | IMCR(592))
#define PIN_EMIOS1_CH0_2            (PIN_PORTA | PIN18 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(592))
#define PIN_EMIOS1_CH0_3            (PIN_PORTC | PIN10 | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT6  | IMCR(592))
#define PIN_EMIOS1_CH0_4            (PIN_PORTC | PIN24 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT4  | IMCR(592))
#define PIN_EMIOS1_CH0_5            (PIN_PORTE | PIN20 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT2  | IMCR(592))
#define PIN_EMIOS1_CH0_6            (PIN_PORTF | PIN16 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT5  | IMCR(592))
#define PIN_EMIOS1_CH1_1            (PIN_PORTA | PIN11 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT3  | IMCR(593))
#define PIN_EMIOS1_CH1_2            (PIN_PORTA | PIN19 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(593))
#define PIN_EMIOS1_CH1_3            (PIN_PORTC | PIN11 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT7  | IMCR(593))
#define PIN_EMIOS1_CH1_4            (PIN_PORTC | PIN25 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT4  | IMCR(593))
#define PIN_EMIOS1_CH1_5            (PIN_PORTE | PIN21 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT2  | IMCR(593))
#define PIN_EMIOS1_CH1_6            (PIN_PORTF | PIN17 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT5  | IMCR(593))
#define PIN_EMIOS1_CH2_1            (PIN_PORTA | PIN12 | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT4  | IMCR(594))
#define PIN_EMIOS1_CH2_2            (PIN_PORTA | PIN20 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT2  | IMCR(594))
#define PIN_EMIOS1_CH2_3            (PIN_PORTC | PIN12 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(594))
#define PIN_EMIOS1_CH2_4            (PIN_PORTE | PIN22 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT3  | IMCR(594))
#define PIN_EMIOS1_CH2_5            (PIN_PORTF | PIN18 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT5  | IMCR(594))
#define PIN_EMIOS1_CH3_1            (PIN_PORTA | PIN13 | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT4  | IMCR(595))
#define PIN_EMIOS1_CH3_2            (PIN_PORTA | PIN21 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(595))
#define PIN_EMIOS1_CH3_3            (PIN_PORTC | PIN13 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT7  | IMCR(595))
#define PIN_EMIOS1_CH3_4            (PIN_PORTC | PIN26 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT3  | IMCR(595))
#define PIN_EMIOS1_CH3_5            (PIN_PORTE | PIN23 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT2  | IMCR(595))
#define PIN_EMIOS1_CH3_6            (PIN_PORTF | PIN19 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT5  | IMCR(595))
#define PIN_EMIOS1_CH4_1            (PIN_PORTA | PIN14 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT7  | IMCR(596))
#define PIN_EMIOS1_CH4_2            (PIN_PORTA | PIN22 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(596))
#define PIN_EMIOS1_CH4_3            (PIN_PORTC | PIN14 | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT8  | IMCR(596))
#define PIN_EMIOS1_CH4_4            (PIN_PORTC | PIN27 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT2  | IMCR(596))
#define PIN_EMIOS1_CH4_5            (PIN_PORTE | PIN4  | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT4  | IMCR(596))
#define PIN_EMIOS1_CH4_6            (PIN_PORTE | PIN24 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT3  | IMCR(596))
#define PIN_EMIOS1_CH4_7            (PIN_PORTF | PIN20 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT5  | IMCR(596))
#define PIN_EMIOS1_CH5_1            (PIN_PORTB | PIN1  | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT1  | IMCR(597))
#define PIN_EMIOS1_CH5_2            (PIN_PORTE | PIN5  | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT4  | IMCR(597))
#define PIN_EMIOS1_CH5_3            (PIN_PORTE | PIN12 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT5  | IMCR(597))
#define PIN_EMIOS1_CH5_4            (PIN_PORTE | PIN13 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT3  | IMCR(597))
#define PIN_EMIOS1_CH5_5            (PIN_PORTE | PIN25 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT2  | IMCR(597))
#define PIN_EMIOS1_CH5_6            (PIN_PORTF | PIN21 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT6  | IMCR(597))
#define PIN_EMIOS1_CH6_1            (PIN_PORTA | PIN23 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT2  | IMCR(598))
#define PIN_EMIOS1_CH6_2            (PIN_PORTB | PIN0  | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT1  | IMCR(598))
#define PIN_EMIOS1_CH6_3            (PIN_PORTC | PIN6  | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT4  | IMCR(598))
#define PIN_EMIOS1_CH6_4            (PIN_PORTE | PIN26 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT3  | IMCR(598))
#define PIN_EMIOS1_CH6_5            (PIN_PORTF | PIN22 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT5  | IMCR(598))
#define PIN_EMIOS1_CH7_1            (PIN_PORTA | PIN24 | PIN_INPUT_ALT2  | IMCR(599))
#define PIN_EMIOS1_CH7_2            (PIN_PORTB | PIN17 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT7  | IMCR(599))
#define PIN_EMIOS1_CH7_3            (PIN_PORTC | PIN7  | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT4  | IMCR(599))
#define PIN_EMIOS1_CH7_4            (PIN_PORTC | PIN28 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT3  | IMCR(599))
#define PIN_EMIOS1_CH7_5            (PIN_PORTE | PIN27 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(599))
#define PIN_EMIOS1_CH7_6            (PIN_PORTF | PIN23 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT5  | IMCR(599))
#define PIN_EMIOS1_CH8_1            (PIN_PORTA | PIN25 | PIN_INPUT_ALT2  | IMCR(600))
#define PIN_EMIOS1_CH8_2            (PIN_PORTC | PIN9  | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT1  | IMCR(600))
#define PIN_EMIOS1_CH8_3            (PIN_PORTE | PIN2  | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT4  | IMCR(600))
#define PIN_EMIOS1_CH8_4            (PIN_PORTF | PIN24 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT3  | IMCR(600))
#define PIN_EMIOS1_CH9_1            (PIN_PORTA | PIN26 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT2  | IMCR(601))
#define PIN_EMIOS1_CH9_2            (PIN_PORTC | PIN8  | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT1  | IMCR(601))
#define PIN_EMIOS1_CH9_3            (PIN_PORTC | PIN16 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT5  | IMCR(601))
#define PIN_EMIOS1_CH9_4            (PIN_PORTF | PIN25 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT3  | IMCR(601))
#define PIN_EMIOS1_CH10_1           (PIN_PORTA | PIN27 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT3  | IMCR(602))
#define PIN_EMIOS1_CH10_2           (PIN_PORTB | PIN4  | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT6  | IMCR(602))
#define PIN_EMIOS1_CH10_3           (PIN_PORTC | PIN29 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(602))
#define PIN_EMIOS1_CH10_4           (PIN_PORTD | PIN10 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT2  | IMCR(602))
#define PIN_EMIOS1_CH10_5           (PIN_PORTF | PIN26 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT4  | IMCR(602))
#define PIN_EMIOS1_CH11_1           (PIN_PORTA | PIN7  | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT1  | IMCR(603))
#define PIN_EMIOS1_CH11_2           (PIN_PORTA | PIN28 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT2  | IMCR(603))
#define PIN_EMIOS1_CH11_3           (PIN_PORTB | PIN5  | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT5  | IMCR(603))
#define PIN_EMIOS1_CH11_4           (PIN_PORTF | PIN27 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT3  | IMCR(603))
#define PIN_EMIOS1_CH12_1           (PIN_PORTA | PIN8  | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT2  | IMCR(604))
#define PIN_EMIOS1_CH12_2           (PIN_PORTA | PIN29 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT3  | IMCR(604))
#define PIN_EMIOS1_CH12_3           (PIN_PORTC | PIN30 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(604))
#define PIN_EMIOS1_CH12_4           (PIN_PORTD | PIN6  | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT5  | IMCR(604))
#define PIN_EMIOS1_CH12_5           (PIN_PORTF | PIN28 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT4  | IMCR(604))
#define PIN_EMIOS1_CH13_1           (PIN_PORTA | PIN6  | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT1  | IMCR(605))
#define PIN_EMIOS1_CH13_2           (PIN_PORTA | PIN30 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT2  | IMCR(605))
#define PIN_EMIOS1_CH13_3           (PIN_PORTE | PIN9  | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT5  | IMCR(605))
#define PIN_EMIOS1_CH13_4           (PIN_PORTF | PIN29 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT3  | IMCR(605))
#define PIN_EMIOS1_CH14_1           (PIN_PORTA | PIN31 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT2  | IMCR(606))
#define PIN_EMIOS1_CH14_2           (PIN_PORTC | PIN31 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(606))
#define PIN_EMIOS1_CH14_3           (PIN_PORTD | PIN15 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT6  | IMCR(606))
#define PIN_EMIOS1_CH14_4           (PIN_PORTE | PIN6  | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT5  | IMCR(606))
#define PIN_EMIOS1_CH14_5           (PIN_PORTF | PIN30 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT3  | IMCR(606))
#define PIN_EMIOS1_CH15_1           (PIN_PORTB | PIN8  | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT6  | IMCR(607))
#define PIN_EMIOS1_CH15_2           (PIN_PORTB | PIN18 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT2  | IMCR(607))
#define PIN_EMIOS1_CH15_3           (PIN_PORTB | PIN19 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT3  | IMCR(607))
#define PIN_EMIOS1_CH15_4           (PIN_PORTD | PIN16 | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT7  | IMCR(607))
#define PIN_EMIOS1_CH15_5           (PIN_PORTD | PIN18 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(607))
#define PIN_EMIOS1_CH15_6           (PIN_PORTF | PIN31 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT4  | IMCR(607))
#define PIN_EMIOS1_CH16_1           (PIN_PORTA | PIN18 | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT1  | IMCR(608))
#define PIN_EMIOS1_CH16_2           (PIN_PORTB | PIN9  | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT5  | IMCR(608))
#define PIN_EMIOS1_CH16_3           (PIN_PORTB | PIN20 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT3  | IMCR(608))
#define PIN_EMIOS1_CH16_4           (PIN_PORTD | PIN19 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT2  | IMCR(608))
#define PIN_EMIOS1_CH16_5           (PIN_PORTG | PIN0  | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT4  | IMCR(608))
#define PIN_EMIOS1_CH17_1           (PIN_PORTB | PIN10 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT4  | IMCR(609))
#define PIN_EMIOS1_CH17_2           (PIN_PORTB | PIN21 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT2  | IMCR(609))
#define PIN_EMIOS1_CH17_3           (PIN_PORTD | PIN20 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(609))
#define PIN_EMIOS1_CH17_4           (PIN_PORTG | PIN1  | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT3  | IMCR(609))
#define PIN_EMIOS1_CH18_1           (PIN_PORTB | PIN11 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT4  | IMCR(610))
#define PIN_EMIOS1_CH18_2           (PIN_PORTB | PIN22 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT2  | IMCR(610))
#define PIN_EMIOS1_CH18_3           (PIN_PORTD | PIN21 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(610))
#define PIN_EMIOS1_CH18_4           (PIN_PORTG | PIN2  | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT3  | IMCR(610))
#define PIN_EMIOS1_CH19_1           (PIN_PORTA | PIN2  | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT4  | IMCR(611))
#define PIN_EMIOS1_CH19_2           (PIN_PORTB | PIN23 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT2  | IMCR(611))
#define PIN_EMIOS1_CH19_3           (PIN_PORTD | PIN22 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(611))
#define PIN_EMIOS1_CH19_4           (PIN_PORTG | PIN3  | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT3  | IMCR(611))
#define PIN_EMIOS1_CH20_1           (PIN_PORTA | PIN3  | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT4  | IMCR(612))
#define PIN_EMIOS1_CH20_2           (PIN_PORTB | PIN24 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT2  | IMCR(612))
#define PIN_EMIOS1_CH20_3           (PIN_PORTD | PIN23 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(612))
#define PIN_EMIOS1_CH20_4           (PIN_PORTG | PIN4  | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT3  | IMCR(612))
#define PIN_EMIOS1_CH21_1           (PIN_PORTB | PIN25 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT2  | IMCR(613))
#define PIN_EMIOS1_CH21_2           (PIN_PORTD | PIN2  | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT4  | IMCR(613))
#define PIN_EMIOS1_CH21_3           (PIN_PORTD | PIN24 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(613))
#define PIN_EMIOS1_CH21_4           (PIN_PORTG | PIN5  | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT3  | IMCR(613))
#define PIN_EMIOS1_CH22_1           (PIN_PORTB | PIN26 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT2  | IMCR(614))
#define PIN_EMIOS1_CH22_2           (PIN_PORTD | PIN3  | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT4  | IMCR(614))
#define PIN_EMIOS1_CH22_3           (PIN_PORTD | PIN25 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(614))
#define PIN_EMIOS1_CH22_4           (PIN_PORTG | PIN6  | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT3  | IMCR(614))
#define PIN_EMIOS1_CH23_1           (PIN_PORTB | PIN27 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT2  | IMCR(615))
#define PIN_EMIOS1_CH23_2           (PIN_PORTD | PIN4  | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT4  | IMCR(615))
#define PIN_EMIOS1_CH23_3           (PIN_PORTD | PIN26 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(615))
#define PIN_EMIOS1_CH23_4           (PIN_PORTG | PIN7  | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT3  | IMCR(615))

