apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k344_pinmux.h
#define PIN_EMIOS2_CH0_1            (PIN_PORTA | PIN18 | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT2  | IMCR(624))
#define PIN_EMIOS2_CH0_2            (PIN_PORTC | PIN24 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT5  | IMCR(624))
#define PIN_EMIOS2_CH0_3            (PIN_PORTD | PIN20 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT3  | IMCR(624))
#define PIN_EMIOS2_CH0_4            (PIN_PORTD | PIN28 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT4  | IMCR(624))
#define PIN_EMIOS2_CH0_5            (PIN_PORTF | PIN0  | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(624))
#define PIN_EMIOS2_CH1_1            (PIN_PORTA | PIN19 | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT2  | IMCR(625))
#define PIN_EMIOS2_CH1_2            (PIN_PORTC | PIN25 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT3  | IMCR(625))
#define PIN_EMIOS2_CH1_3            (PIN_PORTF | PIN1  | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(625))
#define PIN_EMIOS2_CH2_1            (PIN_PORTA | PIN20 | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT2  | IMCR(626))
#define PIN_EMIOS2_CH2_2            (PIN_PORTC | PIN26 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT3  | IMCR(626))
#define PIN_EMIOS2_CH2_3            (PIN_PORTF | PIN2  | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(626))
#define PIN_EMIOS2_CH3_1            (PIN_PORTA | PIN21 | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT2  | IMCR(627))
#define PIN_EMIOS2_CH3_2            (PIN_PORTC | PIN27 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT3  | IMCR(627))
#define PIN_EMIOS2_CH3_3            (PIN_PORTF | PIN3  | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(627))
#define PIN_EMIOS2_CH4_1            (PIN_PORTC | PIN29 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT2  | IMCR(628))
#define PIN_EMIOS2_CH4_2            (PIN_PORTE | PIN24 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT3  | IMCR(628))
#define PIN_EMIOS2_CH4_3            (PIN_PORTF | PIN4  | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(628))
#define PIN_EMIOS2_CH5_1            (PIN_PORTC | PIN30 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT3  | IMCR(629))
#define PIN_EMIOS2_CH5_2            (PIN_PORTE | PIN25 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT2  | IMCR(629))
#define PIN_EMIOS2_CH5_3            (PIN_PORTF | PIN5  | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(629))
#define PIN_EMIOS2_CH6_1            (PIN_PORTC | PIN31 | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT2  | IMCR(630))
#define PIN_EMIOS2_CH6_2            (PIN_PORTE | PIN26 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT3  | IMCR(630))
#define PIN_EMIOS2_CH6_3            (PIN_PORTF | PIN6  | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(630))
#define PIN_EMIOS2_CH7_1            (PIN_PORTA | PIN8  | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT3  | IMCR(631))
#define PIN_EMIOS2_CH7_2            (PIN_PORTD | PIN26 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT1  | IMCR(631))
#define PIN_EMIOS2_CH7_3            (PIN_PORTF | PIN7  | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT2  | IMCR(631))
#define PIN_EMIOS2_CH8_1            (PIN_PORTA | PIN25 | PIN_INPUT_ALT2  | IMCR(632))
#define PIN_EMIOS2_CH8_2            (PIN_PORTD | PIN21 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT3  | IMCR(632))
#define PIN_EMIOS2_CH8_3            (PIN_PORTD | PIN29 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT4  | IMCR(632))
#define PIN_EMIOS2_CH8_4            (PIN_PORTF | PIN8  | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(632))
#define PIN_EMIOS2_CH9_1            (PIN_PORTA | PIN26 | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT2  | IMCR(633))
#define PIN_EMIOS2_CH9_2            (PIN_PORTC | PIN16 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT4  | IMCR(633))
#define PIN_EMIOS2_CH9_3            (PIN_PORTD | PIN27 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT3  | IMCR(633))
#define PIN_EMIOS2_CH9_4            (PIN_PORTF | PIN9  | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(633))
#define PIN_EMIOS2_CH10_1           (PIN_PORTA | PIN27 | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT2  | IMCR(634))
#define PIN_EMIOS2_CH10_2           (PIN_PORTB | PIN28 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT3  | IMCR(634))
#define PIN_EMIOS2_CH10_3           (PIN_PORTF | PIN10 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(634))
#define PIN_EMIOS2_CH11_1           (PIN_PORTA | PIN28 | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT2  | IMCR(635))
#define PIN_EMIOS2_CH11_2           (PIN_PORTB | PIN29 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT3  | IMCR(635))
#define PIN_EMIOS2_CH11_3           (PIN_PORTF | PIN11 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(635))
#define PIN_EMIOS2_CH12_1           (PIN_PORTA | PIN29 | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT1  | IMCR(636))
#define PIN_EMIOS2_CH12_2           (PIN_PORTC | PIN18 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT3  | IMCR(636))
#define PIN_EMIOS2_CH12_3           (PIN_PORTF | PIN12 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT2  | IMCR(636))
#define PIN_EMIOS2_CH13_1           (PIN_PORTA | PIN30 | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT2  | IMCR(637))
#define PIN_EMIOS2_CH13_2           (PIN_PORTC | PIN19 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT3  | IMCR(637))
#define PIN_EMIOS2_CH13_3           (PIN_PORTF | PIN13 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(637))
#define PIN_EMIOS2_CH14_1           (PIN_PORTB | PIN18 | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT2  | IMCR(638))
#define PIN_EMIOS2_CH14_2           (PIN_PORTC | PIN20 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT3  | IMCR(638))
#define PIN_EMIOS2_CH14_3           (PIN_PORTF | PIN14 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(638))
#define PIN_EMIOS2_CH15_1           (PIN_PORTB | PIN19 | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT3  | IMCR(639))
#define PIN_EMIOS2_CH15_2           (PIN_PORTC | PIN21 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT5  | IMCR(639))
#define PIN_EMIOS2_CH15_3           (PIN_PORTF | PIN15 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(639))
#define PIN_EMIOS2_CH15_4           (PIN_PORTG | PIN15 | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT4  | IMCR(639))
#define PIN_EMIOS2_CH16_1           (PIN_PORTB | PIN20 | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT2  | IMCR(640))
#define PIN_EMIOS2_CH16_2           (PIN_PORTD | PIN30 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT3  | IMCR(640))
#define PIN_EMIOS2_CH16_3           (PIN_PORTF | PIN16 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT4  | IMCR(640))
#define PIN_EMIOS2_CH16_4           (PIN_PORTG | PIN16 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(640))
#define PIN_EMIOS2_CH17_1           (PIN_PORTB | PIN21 | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT2  | IMCR(641))
#define PIN_EMIOS2_CH17_2           (PIN_PORTE | PIN18 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT4  | IMCR(641))
#define PIN_EMIOS2_CH17_3           (PIN_PORTF | PIN17 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT3  | IMCR(641))
#define PIN_EMIOS2_CH17_4           (PIN_PORTG | PIN17 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(641))
#define PIN_EMIOS2_CH18_1           (PIN_PORTA | PIN14 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT4  | IMCR(642))
#define PIN_EMIOS2_CH18_2           (PIN_PORTB | PIN22 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT2  | IMCR(642))
#define PIN_EMIOS2_CH18_3           (PIN_PORTF | PIN18 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT3  | IMCR(642))
#define PIN_EMIOS2_CH18_4           (PIN_PORTG | PIN18 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(642))
#define PIN_EMIOS2_CH19_1           (PIN_PORTB | PIN23 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT2  | IMCR(643))
#define PIN_EMIOS2_CH19_2           (PIN_PORTE | PIN21 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT4  | IMCR(643))
#define PIN_EMIOS2_CH19_3           (PIN_PORTF | PIN19 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT3  | IMCR(643))
#define PIN_EMIOS2_CH19_4           (PIN_PORTG | PIN19 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(643))
#define PIN_EMIOS2_CH20_1           (PIN_PORTB | PIN24 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT2  | IMCR(644))
#define PIN_EMIOS2_CH20_2           (PIN_PORTE | PIN22 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT4  | IMCR(644))
#define PIN_EMIOS2_CH20_3           (PIN_PORTF | PIN20 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT3  | IMCR(644))
#define PIN_EMIOS2_CH20_4           (PIN_PORTG | PIN20 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(644))
#define PIN_EMIOS2_CH21_1           (PIN_PORTB | PIN25 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT2  | IMCR(645))
#define PIN_EMIOS2_CH21_2           (PIN_PORTE | PIN23 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT4  | IMCR(645))
#define PIN_EMIOS2_CH21_3           (PIN_PORTF | PIN21 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT3  | IMCR(645))
#define PIN_EMIOS2_CH21_4           (PIN_PORTG | PIN21 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(645))
#define PIN_EMIOS2_CH22_1           (PIN_PORTB | PIN26 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT2  | IMCR(646))
#define PIN_EMIOS2_CH22_2           (PIN_PORTD | PIN22 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT3  | IMCR(646))
#define PIN_EMIOS2_CH22_3           (PIN_PORTD | PIN31 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT4  | IMCR(646))
#define PIN_EMIOS2_CH22_4           (PIN_PORTF | PIN22 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT5  | IMCR(646))
#define PIN_EMIOS2_CH22_5           (PIN_PORTG | PIN22 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(646))
#define PIN_EMIOS2_CH23_1           (PIN_PORTB | PIN27 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT2  | IMCR(647))
#define PIN_EMIOS2_CH23_2           (PIN_PORTD | PIN23 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT3  | IMCR(647))
#define PIN_EMIOS2_CH23_3           (PIN_PORTE | PIN17 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT4  | IMCR(647))
#define PIN_EMIOS2_CH23_4           (PIN_PORTF | PIN23 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT5  | IMCR(647))
#define PIN_EMIOS2_CH23_5           (PIN_PORTG | PIN23 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(647))

