apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k344_pinmux.h
/* Fault Collection and Control Unit (FCCU) */

#define PIN_FCCU_ERR_IN0_1          (PIN_PORTA | PIN2  | PIN_INPUT_ALT1  | IMCR(660))
#define PIN_FCCU_ERR_IN0_2          (PIN_PORTE | PIN15 | PIN_INPUT_ALT2  | IMCR(660))
#define PIN_FCCU_ERR_IN0_3          (PIN_PORTF | PIN14 | PIN_INPUT_ALT3  | IMCR(660))
#define PIN_FCCU_ERR_IN1_1          (PIN_PORTA | PIN3  | PIN_INPUT_ALT1  | IMCR(661))
#define PIN_FCCU_ERR_IN1_2          (PIN_PORTE | PIN16 | PIN_INPUT_ALT2  | IMCR(661))
#define PIN_FCCU_ERR_IN1_3          (PIN_PORTF | PIN15 | PIN_INPUT_ALT3  | IMCR(661))
#define PIN_FCCU_ERR_OUT0_1         (PIN_PORTA | PIN2  | PIN_OUTPUT_ALT1)
#define PIN_FCCU_ERR_OUT0_2         (PIN_PORTE | PIN15 | PIN_OUTPUT_ALT1)
#define PIN_FCCU_ERR_OUT0_3         (PIN_PORTF | PIN14 | PIN_OUTPUT_ALT4)
#define PIN_FCCU_ERR_OUT1_1         (PIN_PORTA | PIN3  | PIN_OUTPUT_ALT1)
#define PIN_FCCU_ERR_OUT1_2         (PIN_PORTE | PIN16 | PIN_OUTPUT_ALT1)
#define PIN_FCCU_ERR_OUT1_3         (PIN_PORTF | PIN15 | PIN_OUTPUT_ALT5)

/* FlexIO */

#define PIN_FXIO_D0_1               (PIN_PORTA | PIN10 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT2  | IMCR(664))
#define PIN_FXIO_D0_2               (PIN_PORTA | PIN21 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT3  | IMCR(664))
#define PIN_FXIO_D0_3               (PIN_PORTA | PIN31 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT6  | IMCR(664))
#define PIN_FXIO_D0_4               (PIN_PORTC | PIN30 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT4  | IMCR(664))
#define PIN_FXIO_D0_5               (PIN_PORTD | PIN0  | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT1  | IMCR(664))
#define PIN_FXIO_D0_6               (PIN_PORTD | PIN9  | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT5  | IMCR(664))
#define PIN_FXIO_D0_7               (PIN_PORTF | PIN4  | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT7  | IMCR(664))
#define PIN_FXIO_D1_1               (PIN_PORTA | PIN11 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT2  | IMCR(665))
#define PIN_FXIO_D1_2               (PIN_PORTA | PIN22 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT3  | IMCR(665))
#define PIN_FXIO_D1_3               (PIN_PORTA | PIN26 | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT7  | IMCR(665))
#define PIN_FXIO_D1_4               (PIN_PORTB | PIN18 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT6  | IMCR(665))
#define PIN_FXIO_D1_5               (PIN_PORTC | PIN31 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT4  | IMCR(665))
#define PIN_FXIO_D1_6               (PIN_PORTD | PIN1  | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT1  | IMCR(665))
#define PIN_FXIO_D1_7               (PIN_PORTD | PIN8  | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT5  | IMCR(665))
#define PIN_FXIO_D1_8               (PIN_PORTF | PIN7  | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT8  | IMCR(665))
#define PIN_FXIO_D2_1               (PIN_PORTA | PIN0  | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT2  | IMCR(666))
#define PIN_FXIO_D2_2               (PIN_PORTA | PIN23 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT3  | IMCR(666))
#define PIN_FXIO_D2_3               (PIN_PORTA | PIN25 | PIN_INPUT_ALT6  | IMCR(666))
#define PIN_FXIO_D2_4               (PIN_PORTB | PIN19 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT5  | IMCR(666))
#define PIN_FXIO_D2_5               (PIN_PORTC | PIN28 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT7  | IMCR(666))
#define PIN_FXIO_D2_6               (PIN_PORTD | PIN18 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT4  | IMCR(666))
#define PIN_FXIO_D2_7               (PIN_PORTE | PIN1  | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT8  | IMCR(666))
#define PIN_FXIO_D2_8               (PIN_PORTE | PIN15 | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT1  | IMCR(666))
#define PIN_FXIO_D2_9               (PIN_PORTF | PIN8  | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT9  | IMCR(666))
#define PIN_FXIO_D3_1               (PIN_PORTA | PIN1  | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT1  | IMCR(667))
#define PIN_FXIO_D3_2               (PIN_PORTA | PIN24 | PIN_INPUT_ALT3  | IMCR(667))
#define PIN_FXIO_D3_3               (PIN_PORTB | PIN20 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT5  | IMCR(667))
#define PIN_FXIO_D3_4               (PIN_PORTC | PIN29 | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT6  | IMCR(667))
#define PIN_FXIO_D3_5               (PIN_PORTD | PIN19 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT4  | IMCR(667))
#define PIN_FXIO_D3_6               (PIN_PORTE | PIN0  | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT7  | IMCR(667))
#define PIN_FXIO_D3_7               (PIN_PORTE | PIN16 | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT2  | IMCR(667))
#define PIN_FXIO_D3_8               (PIN_PORTF | PIN14 | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT8  | IMCR(667))
#define PIN_FXIO_D4_1               (PIN_PORTA | PIN2  | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT3  | IMCR(668))
#define PIN_FXIO_D4_2               (PIN_PORTB | PIN21 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT5  | IMCR(668))
#define PIN_FXIO_D4_3               (PIN_PORTB | PIN23 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT6  | IMCR(668))
#define PIN_FXIO_D4_4               (PIN_PORTC | PIN5  | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT7  | IMCR(668))
#define PIN_FXIO_D4_5               (PIN_PORTD | PIN2  | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT1  | IMCR(668))
#define PIN_FXIO_D4_6               (PIN_PORTE | PIN10 | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT2  | IMCR(668))
#define PIN_FXIO_D4_7               (PIN_PORTE | PIN18 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT4  | IMCR(668))
#define PIN_FXIO_D4_8               (PIN_PORTF | PIN20 | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT8  | IMCR(668))
#define PIN_FXIO_D5_1               (PIN_PORTA | PIN3  | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT3  | IMCR(669))
#define PIN_FXIO_D5_2               (PIN_PORTA | PIN27 | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT9  | IMCR(669))
#define PIN_FXIO_D5_3               (PIN_PORTB | PIN24 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT6  | IMCR(669))
#define PIN_FXIO_D5_4               (PIN_PORTC | PIN1  | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT7  | IMCR(669))
#define PIN_FXIO_D5_5               (PIN_PORTC | PIN4  | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT8  | IMCR(669))
#define PIN_FXIO_D5_6               (PIN_PORTD | PIN3  | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT2  | IMCR(669))
#define PIN_FXIO_D5_7               (PIN_PORTE | PIN11 | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT1  | IMCR(669))
#define PIN_FXIO_D5_8               (PIN_PORTE | PIN13 | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT5  | IMCR(669))
#define PIN_FXIO_D5_9               (PIN_PORTE | PIN17 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT4  | IMCR(669))
#define PIN_FXIO_D5_10              (PIN_PORTE | PIN24 | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT10 | IMCR(669))
#define PIN_FXIO_D5_11              (PIN_PORTF | PIN21 | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT11 | IMCR(669))
#define PIN_FXIO_D6_1               (PIN_PORTA | PIN4  | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT8  | IMCR(670))
#define PIN_FXIO_D6_2               (PIN_PORTA | PIN8  | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT2  | IMCR(670))
#define PIN_FXIO_D6_3               (PIN_PORTB | PIN25 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT5  | IMCR(670))
#define PIN_FXIO_D6_4               (PIN_PORTC | PIN18 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT9  | IMCR(670))
#define PIN_FXIO_D6_5               (PIN_PORTD | PIN2  | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT3  | IMCR(670))
#define PIN_FXIO_D6_6               (PIN_PORTD | PIN15 | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT7  | IMCR(670))
#define PIN_FXIO_D6_7               (PIN_PORTD | PIN31 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT4  | IMCR(670))
#define PIN_FXIO_D6_8               (PIN_PORTE | PIN3  | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT6  | IMCR(670))
#define PIN_FXIO_D6_9               (PIN_PORTE | PIN4  | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT1  | IMCR(670))
#define PIN_FXIO_D6_10              (PIN_PORTF | PIN25 | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT10 | IMCR(670))
#define PIN_FXIO_D7_1               (PIN_PORTA | PIN9  | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT2  | IMCR(671))
#define PIN_FXIO_D7_2               (PIN_PORTB | PIN26 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT6  | IMCR(671))
#define PIN_FXIO_D7_3               (PIN_PORTD | PIN3  | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT3  | IMCR(671))
#define PIN_FXIO_D7_4               (PIN_PORTD | PIN13 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT7  | IMCR(671))
#define PIN_FXIO_D7_5               (PIN_PORTD | PIN26 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT4  | IMCR(671))
#define PIN_FXIO_D7_6               (PIN_PORTE | PIN5  | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT1  | IMCR(671))
#define PIN_FXIO_D7_7               (PIN_PORTE | PIN14 | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT5  | IMCR(671))
#define PIN_FXIO_D7_8               (PIN_PORTF | PIN28 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT8  | IMCR(671))
#define PIN_FXIO_D8_1               (PIN_PORTA | PIN13 | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT4  | IMCR(672))
#define PIN_FXIO_D8_2               (PIN_PORTB | PIN13 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT3  | IMCR(672))
#define PIN_FXIO_D8_3               (PIN_PORTB | PIN27 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT2  | IMCR(672))
#define PIN_FXIO_D8_4               (PIN_PORTE | PIN8  | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT5  | IMCR(672))
#define PIN_FXIO_D8_5               (PIN_PORTE | PIN12 | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT1  | IMCR(672))
#define PIN_FXIO_D8_6               (PIN_PORTF | PIN29 | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT6  | IMCR(672))
#define PIN_FXIO_D9_1               (PIN_PORTA | PIN7  | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT3  | IMCR(673))
#define PIN_FXIO_D9_2               (PIN_PORTA | PIN12 | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT4  | IMCR(673))
#define PIN_FXIO_D9_3               (PIN_PORTB | PIN28 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT2  | IMCR(673))
#define PIN_FXIO_D9_4               (PIN_PORTD | PIN17 | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT1  | IMCR(673))
#define PIN_FXIO_D9_5               (PIN_PORTF | PIN31 | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT5  | IMCR(673))
#define PIN_FXIO_D10_1              (PIN_PORTB | PIN29 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT2  | IMCR(674))
#define PIN_FXIO_D10_2              (PIN_PORTC | PIN7  | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT3  | IMCR(674))
#define PIN_FXIO_D10_3              (PIN_PORTD | PIN9  | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT4  | IMCR(674))
#define PIN_FXIO_D10_4              (PIN_PORTD | PIN15 | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT1  | IMCR(674))
#define PIN_FXIO_D10_5              (PIN_PORTG | PIN6  | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT5  | IMCR(674))
#define PIN_FXIO_D11_1              (PIN_PORTB | PIN30 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT2  | IMCR(675))
#define PIN_FXIO_D11_2              (PIN_PORTC | PIN6  | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT3  | IMCR(675))
#define PIN_FXIO_D11_3              (PIN_PORTD | PIN8  | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT5  | IMCR(675))
#define PIN_FXIO_D11_4              (PIN_PORTE | PIN7  | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT4  | IMCR(675))
#define PIN_FXIO_D11_5              (PIN_PORTE | PIN9  | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT1  | IMCR(675))
#define PIN_FXIO_D11_6              (PIN_PORTE | PIN24 | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT6  | IMCR(675))
#define PIN_FXIO_D11_7              (PIN_PORTG | PIN7  | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT7  | IMCR(675))
#define PIN_FXIO_D12_1              (PIN_PORTC | PIN8  | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT3  | IMCR(676))
#define PIN_FXIO_D12_2              (PIN_PORTC | PIN18 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT2  | IMCR(676))
#define PIN_FXIO_D12_3              (PIN_PORTE | PIN6  | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT4  | IMCR(676))
#define PIN_FXIO_D12_4              (PIN_PORTE | PIN8  | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT1  | IMCR(676))
#define PIN_FXIO_D12_5              (PIN_PORTG | PIN8  | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT5  | IMCR(676))
#define PIN_FXIO_D13_1              (PIN_PORTC | PIN9  | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT3  | IMCR(677))
#define PIN_FXIO_D13_2              (PIN_PORTC | PIN19 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT2  | IMCR(677))
#define PIN_FXIO_D13_3              (PIN_PORTD | PIN6  | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT1  | IMCR(677))
#define PIN_FXIO_D13_4              (PIN_PORTE | PIN2  | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT4  | IMCR(677))
#define PIN_FXIO_D13_5              (PIN_PORTG | PIN13 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT5  | IMCR(677))
#define PIN_FXIO_D14_1              (PIN_PORTA | PIN14 | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT4  | IMCR(678))
#define PIN_FXIO_D14_2              (PIN_PORTB | PIN0  | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT3  | IMCR(678))
#define PIN_FXIO_D14_3              (PIN_PORTC | PIN17 | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT1  | IMCR(678))
#define PIN_FXIO_D14_4              (PIN_PORTC | PIN20 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT2  | IMCR(678))
#define PIN_FXIO_D14_5              (PIN_PORTG | PIN15 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT5  | IMCR(678))
#define PIN_FXIO_D15_1              (PIN_PORTB | PIN22 | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT5  | IMCR(679))
#define PIN_FXIO_D15_2              (PIN_PORTC | PIN11 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT3  | IMCR(679))
#define PIN_FXIO_D15_3              (PIN_PORTC | PIN16 | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT1  | IMCR(679))
#define PIN_FXIO_D15_4              (PIN_PORTC | PIN21 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT2  | IMCR(679))
#define PIN_FXIO_D15_5              (PIN_PORTD | PIN5  | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT4  | IMCR(679))
#define PIN_FXIO_D15_6              (PIN_PORTG | PIN16 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT6  | IMCR(679))
#define PIN_FXIO_D16_1              (PIN_PORTC | PIN13 | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT3  | IMCR(680))
#define PIN_FXIO_D16_2              (PIN_PORTC | PIN14 | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT1  | IMCR(680))
#define PIN_FXIO_D16_3              (PIN_PORTC | PIN23 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT2  | IMCR(680))
#define PIN_FXIO_D16_4              (PIN_PORTG | PIN17 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT4  | IMCR(680))
#define PIN_FXIO_D17_1              (PIN_PORTB | PIN3  | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT1  | IMCR(681))
#define PIN_FXIO_D17_2              (PIN_PORTC | PIN24 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT2  | IMCR(681))
#define PIN_FXIO_D17_3              (PIN_PORTG | PIN18 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT3  | IMCR(681))
#define PIN_FXIO_D18_1              (PIN_PORTB | PIN2  | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT1  | IMCR(682))
#define PIN_FXIO_D18_2              (PIN_PORTC | PIN25 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT2  | IMCR(682))
#define PIN_FXIO_D18_3              (PIN_PORTG | PIN19 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT3  | IMCR(682))
#define PIN_FXIO_D19_1              (PIN_PORTA | PIN6  | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT4  | IMCR(683))
#define PIN_FXIO_D19_2              (PIN_PORTA | PIN17 | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT1  | IMCR(683))
#define PIN_FXIO_D19_3              (PIN_PORTC | PIN11 | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT3  | IMCR(683))
#define PIN_FXIO_D19_4              (PIN_PORTC | PIN12 | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT5  | IMCR(683))
#define PIN_FXIO_D19_5              (PIN_PORTC | PIN26 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT2  | IMCR(683))
#define PIN_FXIO_D19_6              (PIN_PORTG | PIN20 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT6  | IMCR(683))
#define PIN_FXIO_D20_1              (PIN_PORTB | PIN17 | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT1  | IMCR(684))
#define PIN_FXIO_D20_2              (PIN_PORTC | PIN27 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT2  | IMCR(684))
#define PIN_FXIO_D20_3              (PIN_PORTG | PIN21 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT3  | IMCR(684))
#define PIN_FXIO_D21_1              (PIN_PORTB | PIN16 | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT1  | IMCR(685))
#define PIN_FXIO_D21_2              (PIN_PORTC | PIN28 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT2  | IMCR(685))
#define PIN_FXIO_D21_3              (PIN_PORTG | PIN22 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT3  | IMCR(685))
#define PIN_FXIO_D22_1              (PIN_PORTB | PIN15 | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT1  | IMCR(686))
#define PIN_FXIO_D22_2              (PIN_PORTC | PIN29 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT2  | IMCR(686))
#define PIN_FXIO_D22_3              (PIN_PORTG | PIN23 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT3  | IMCR(686))
#define PIN_FXIO_D23_1              (PIN_PORTB | PIN14 | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT1  | IMCR(687))
#define PIN_FXIO_D23_2              (PIN_PORTC | PIN30 | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT2  | IMCR(687))
#define PIN_FXIO_D23_3              (PIN_PORTG | PIN24 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT3  | IMCR(687))
#define PIN_FXIO_D24_1              (PIN_PORTB | PIN13 | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT1  | IMCR(688))
#define PIN_FXIO_D24_2              (PIN_PORTC | PIN31 | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT2  | IMCR(688))
#define PIN_FXIO_D24_3              (PIN_PORTG | PIN25 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT3  | IMCR(688))
#define PIN_FXIO_D25_1              (PIN_PORTB | PIN12 | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT1  | IMCR(689))
#define PIN_FXIO_D25_2              (PIN_PORTD | PIN20 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT2  | IMCR(689))
#define PIN_FXIO_D25_3              (PIN_PORTG | PIN26 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT3  | IMCR(689))
#define PIN_FXIO_D26_1              (PIN_PORTB | PIN11 | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT1  | IMCR(690))
#define PIN_FXIO_D26_2              (PIN_PORTD | PIN21 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT2  | IMCR(690))
#define PIN_FXIO_D26_3              (PIN_PORTG | PIN27 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT3  | IMCR(690))
#define PIN_FXIO_D27_1              (PIN_PORTB | PIN10 | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT1  | IMCR(691))
#define PIN_FXIO_D27_2              (PIN_PORTD | PIN22 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT2  | IMCR(691))
#define PIN_FXIO_D28_1              (PIN_PORTB | PIN9  | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT1  | IMCR(692))
#define PIN_FXIO_D28_2              (PIN_PORTD | PIN23 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT2  | IMCR(692))
#define PIN_FXIO_D29_1              (PIN_PORTB | PIN8  | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT1  | IMCR(693))
#define PIN_FXIO_D29_2              (PIN_PORTD | PIN24 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT2  | IMCR(693))
#define PIN_FXIO_D30_1              (PIN_PORTA | PIN16 | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT1  | IMCR(694))
#define PIN_FXIO_D30_2              (PIN_PORTD | PIN26 | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT2  | IMCR(694))
#define PIN_FXIO_D31_1              (PIN_PORTA | PIN15 | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT1  | IMCR(695))
#define PIN_FXIO_D31_2              (PIN_PORTD | PIN27 | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT2  | IMCR(695))

