apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k344_pinmux.h
/* Hardware Security Engine (HSE) */

#define PIN_HSE_TAMPER_EXTIN0_1     (PIN_PORTB | PIN1  | PIN_INPUT_ALT1  | IMCR(855))
#define PIN_HSE_TAMPER_EXTIN0_2     (PIN_PORTB | PIN31 | PIN_INPUT_ALT3  | IMCR(855))
#define PIN_HSE_TAMPER_EXTIN0_3     (PIN_PORTD | PIN24 | PIN_INPUT_ALT2  | IMCR(855))
#define PIN_HSE_TAMPER_EXTIN0_4     (PIN_PORTF | PIN11 | PIN_INPUT_ALT4  | IMCR(855))
#define PIN_HSE_TAMPER_LOOP_OUT0_1  (PIN_PORTB | PIN0  | PIN_OUTPUT_ALT7)
#define PIN_HSE_TAMPER_LOOP_OUT0_2  (PIN_PORTB | PIN30 | PIN_OUTPUT_ALT5)
#define PIN_HSE_TAMPER_LOOP_OUT0_3  (PIN_PORTD | PIN23 | PIN_OUTPUT_ALT5)
#define PIN_HSE_TAMPER_LOOP_OUT0_4  (PIN_PORTF | PIN19 | PIN_OUTPUT_ALT6)

/* JTAG Debug */

#define PIN_JTAG_TCK                (PIN_PORTC | PIN4  | PIN_INPUT_ALT0  | IMCR(696))
#define PIN_JTAG_TDI                (PIN_PORTC | PIN5  | PIN_INPUT_ALT0  | IMCR(697))
#define PIN_JTAG_TDO                (PIN_PORTA | PIN10 | PIN_OUTPUT_ALT7)
#define PIN_JTAG_TMS                (PIN_PORTA | PIN4  | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT0  | IMCR(698))

/* Logic Control Unit (LCU) */

#define PIN_LCU0_OUT0_1             (PIN_PORTD | PIN3  | PIN_OUTPUT_ALT6)
#define PIN_LCU0_OUT0_2             (PIN_PORTD | PIN26 | PIN_OUTPUT_ALT7)
#define PIN_LCU0_OUT1_1             (PIN_PORTD | PIN2  | PIN_OUTPUT_ALT1)
#define PIN_LCU0_OUT1_2             (PIN_PORTD | PIN27 | PIN_OUTPUT_ALT7)
#define PIN_LCU0_OUT2_1             (PIN_PORTA | PIN3  | PIN_OUTPUT_ALT4)
#define PIN_LCU0_OUT2_2             (PIN_PORTB | PIN12 | PIN_OUTPUT_ALT6)
#define PIN_LCU0_OUT2_3             (PIN_PORTD | PIN28 | PIN_OUTPUT_ALT5)
#define PIN_LCU0_OUT3_1             (PIN_PORTA | PIN2  | PIN_OUTPUT_ALT6)
#define PIN_LCU0_OUT3_2             (PIN_PORTB | PIN13 | PIN_OUTPUT_ALT5)
#define PIN_LCU0_OUT3_3             (PIN_PORTD | PIN29 | PIN_OUTPUT_ALT5)
#define PIN_LCU0_OUT4_1             (PIN_PORTA | PIN0  | PIN_OUTPUT_ALT3)
#define PIN_LCU0_OUT4_2             (PIN_PORTD | PIN21 | PIN_OUTPUT_ALT5)
#define PIN_LCU0_OUT5_1             (PIN_PORTA | PIN1  | PIN_OUTPUT_ALT5)
#define PIN_LCU0_OUT5_2             (PIN_PORTD | PIN22 | PIN_OUTPUT_ALT6)
#define PIN_LCU0_OUT6_1             (PIN_PORTC | PIN7  | PIN_OUTPUT_ALT4)
#define PIN_LCU0_OUT6_2             (PIN_PORTD | PIN4  | PIN_OUTPUT_ALT5)
#define PIN_LCU0_OUT7_1             (PIN_PORTB | PIN14 | PIN_OUTPUT_ALT4)
#define PIN_LCU0_OUT7_2             (PIN_PORTC | PIN6  | PIN_OUTPUT_ALT4)
#define PIN_LCU0_OUT8_1             (PIN_PORTB | PIN11 | PIN_OUTPUT_ALT5)
#define PIN_LCU0_OUT8_2             (PIN_PORTD | PIN30 | PIN_OUTPUT_ALT5)
#define PIN_LCU0_OUT9_1             (PIN_PORTB | PIN10 | PIN_OUTPUT_ALT6)
#define PIN_LCU0_OUT9_2             (PIN_PORTD | PIN31 | PIN_OUTPUT_ALT5)
#define PIN_LCU0_OUT10_1            (PIN_PORTB | PIN9  | PIN_OUTPUT_ALT6)
#define PIN_LCU0_OUT10_2            (PIN_PORTD | PIN23 | PIN_OUTPUT_ALT6)
#define PIN_LCU0_OUT11_1            (PIN_PORTB | PIN8  | PIN_OUTPUT_ALT5)
#define PIN_LCU0_OUT11_2            (PIN_PORTD | PIN24 | PIN_OUTPUT_ALT6)

#define PIN_LCU1_OUT0_1             (PIN_PORTC | PIN15 | PIN_OUTPUT_ALT6)
#define PIN_LCU1_OUT0_2             (PIN_PORTC | PIN23 | PIN_OUTPUT_ALT6)
#define PIN_LCU1_OUT1_1             (PIN_PORTC | PIN14 | PIN_OUTPUT_ALT6)
#define PIN_LCU1_OUT1_2             (PIN_PORTC | PIN24 | PIN_OUTPUT_ALT6)
#define PIN_LCU1_OUT2_1             (PIN_PORTB | PIN3  | PIN_OUTPUT_ALT6)
#define PIN_LCU1_OUT2_2             (PIN_PORTC | PIN25 | PIN_OUTPUT_ALT6)
#define PIN_LCU1_OUT3_1             (PIN_PORTB | PIN2  | PIN_OUTPUT_ALT5)
#define PIN_LCU1_OUT3_2             (PIN_PORTC | PIN27 | PIN_OUTPUT_ALT6)
#define PIN_LCU1_OUT4_1             (PIN_PORTB | PIN1  | PIN_OUTPUT_ALT7)
#define PIN_LCU1_OUT4_2             (PIN_PORTC | PIN21 | PIN_OUTPUT_ALT6)
#define PIN_LCU1_OUT5_1             (PIN_PORTB | PIN0  | PIN_OUTPUT_ALT5)
#define PIN_LCU1_OUT5_2             (PIN_PORTC | PIN20 | PIN_OUTPUT_ALT6)
#define PIN_LCU1_OUT6_1             (PIN_PORTC | PIN9  | PIN_OUTPUT_ALT5)
#define PIN_LCU1_OUT6_2             (PIN_PORTC | PIN19 | PIN_OUTPUT_ALT6)
#define PIN_LCU1_OUT7_1             (PIN_PORTC | PIN8  | PIN_OUTPUT_ALT5)
#define PIN_LCU1_OUT7_2             (PIN_PORTC | PIN18 | PIN_OUTPUT_ALT6)
#define PIN_LCU1_OUT8_1             (PIN_PORTC | PIN13 | PIN_OUTPUT_ALT6)
#define PIN_LCU1_OUT8_2             (PIN_PORTC | PIN28 | PIN_OUTPUT_ALT6)
#define PIN_LCU1_OUT9_1             (PIN_PORTC | PIN12 | PIN_OUTPUT_ALT6)
#define PIN_LCU1_OUT9_2             (PIN_PORTC | PIN26 | PIN_OUTPUT_ALT6)
#define PIN_LCU1_OUT10_1            (PIN_PORTB | PIN29 | PIN_OUTPUT_ALT6)
#define PIN_LCU1_OUT10_2            (PIN_PORTC | PIN11 | PIN_OUTPUT_ALT7)
#define PIN_LCU1_OUT11_1            (PIN_PORTB | PIN28 | PIN_OUTPUT_ALT6)
#define PIN_LCU1_OUT11_2            (PIN_PORTC | PIN10 | PIN_OUTPUT_ALT6)

/* LPI2C */

#define PIN_LPI2C0_HREQ_1           (PIN_PORTB | PIN11 | PIN_INPUT_ALT1  | IMCR(723))
#define PIN_LPI2C0_HREQ_2           (PIN_PORTC | PIN7  | PIN_INPUT_ALT2  | IMCR(723))
#define PIN_LPI2C0_SCL_1            (PIN_PORTC | PIN8  | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT1  | IMCR(724))
#define PIN_LPI2C0_SCL_2            (PIN_PORTD | PIN14 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT2  | IMCR(724))
#define PIN_LPI2C0_SCL_3            (PIN_PORTF | PIN20 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT3  | IMCR(724))
#define PIN_LPI2C0_SCLS             (PIN_PORTB | PIN1  | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT1  | IMCR(725))
#define PIN_LPI2C0_SDA_1            (PIN_PORTC | PIN9  | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT1  | IMCR(726))
#define PIN_LPI2C0_SDA_2            (PIN_PORTD | PIN13 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT2  | IMCR(726))
#define PIN_LPI2C0_SDA_3            (PIN_PORTF | PIN21 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT3  | IMCR(726))
#define PIN_LPI2C0_SDAS             (PIN_PORTB | PIN0  | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT1  | IMCR(727))

#define PIN_LPI2C1_HREQ_1           (PIN_PORTC | PIN5  | PIN_INPUT_ALT2  | IMCR(728))
#define PIN_LPI2C1_HREQ_2           (PIN_PORTD | PIN12 | PIN_INPUT_ALT1  | IMCR(728))
#define PIN_LPI2C1_SCL_1            (PIN_PORTC | PIN7  | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT1  | IMCR(729))
#define PIN_LPI2C1_SCL_2            (PIN_PORTC | PIN15 | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT6  | IMCR(729))
#define PIN_LPI2C1_SCL_3            (PIN_PORTC | PIN28 | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT4  | IMCR(729))
#define PIN_LPI2C1_SCL_4            (PIN_PORTD | PIN9  | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT2  | IMCR(729))
#define PIN_LPI2C1_SCL_5            (PIN_PORTF | PIN7  | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT5  | IMCR(729))
#define PIN_LPI2C1_SCLS             (PIN_PORTC | PIN17 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT2  | IMCR(730))
#define PIN_LPI2C1_SDA_1            (PIN_PORTC | PIN6  | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT2  | IMCR(731))
#define PIN_LPI2C1_SDA_2            (PIN_PORTC | PIN16 | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT5  | IMCR(731))
#define PIN_LPI2C1_SDA_3            (PIN_PORTC | PIN29 | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT3  | IMCR(731))
#define PIN_LPI2C1_SDA_4            (PIN_PORTD | PIN8  | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(731))
#define PIN_LPI2C1_SDA_5            (PIN_PORTF | PIN8  | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT4  | IMCR(731))
#define PIN_LPI2C1_SDAS             (PIN_PORTC | PIN16 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT1  | IMCR(732))

/* LPSPI */

#define PIN_LPSPI0_PCS0_1           (PIN_PORTA | PIN26 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT3  | IMCR(733))
#define PIN_LPSPI0_PCS0_2           (PIN_PORTB | PIN0  | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT1  | IMCR(733))
#define PIN_LPSPI0_PCS0_3           (PIN_PORTB | PIN5  | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT2  | IMCR(733))
#define PIN_LPSPI0_PCS0_4           (PIN_PORTC | PIN7  | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT6  | IMCR(733))
#define PIN_LPSPI0_PCS0_5           (PIN_PORTD | PIN6  | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT7  | IMCR(733))
#define PIN_LPSPI0_PCS0_6           (PIN_PORTE | PIN4  | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT5  | IMCR(733))
#define PIN_LPSPI0_PCS0_7           (PIN_PORTF | PIN28 | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT4  | IMCR(733))
#define PIN_LPSPI0_PCS1_1           (PIN_PORTA | PIN7  | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT3  | IMCR(734))
#define PIN_LPSPI0_PCS1_2           (PIN_PORTA | PIN31 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT2  | IMCR(734))
#define PIN_LPSPI0_PCS1_3           (PIN_PORTB | PIN5  | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT1  | IMCR(734))
#define PIN_LPSPI0_PCS1_4           (PIN_PORTC | PIN6  | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT4  | IMCR(734))
#define PIN_LPSPI0_PCS1_5           (PIN_PORTD | PIN5  | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT5  | IMCR(734))
#define PIN_LPSPI0_PCS2_1           (PIN_PORTC | PIN2  | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT2  | IMCR(735))
#define PIN_LPSPI0_PCS2_2           (PIN_PORTE | PIN6  | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(735))
#define PIN_LPSPI0_PCS3_1           (PIN_PORTA | PIN15 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT1  | IMCR(736))
#define PIN_LPSPI0_PCS3_2           (PIN_PORTD | PIN7  | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT2  | IMCR(736))
#define PIN_LPSPI0_PCS4             (PIN_PORTA | PIN16 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT1  | IMCR(737))
#define PIN_LPSPI0_PCS5             (PIN_PORTB | PIN8  | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT1  | IMCR(738))
#define PIN_LPSPI0_PCS6             (PIN_PORTA | PIN1  | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT1  | IMCR(739))
#define PIN_LPSPI0_PCS7             (PIN_PORTA | PIN0  | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT1  | IMCR(740))
#define PIN_LPSPI0_SCK_1            (PIN_PORTC | PIN8  | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT1  | IMCR(741))
#define PIN_LPSPI0_SCK_2            (PIN_PORTD | PIN11 | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT5  | IMCR(741))
#define PIN_LPSPI0_SCK_3            (PIN_PORTD | PIN15 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT3  | IMCR(741))
#define PIN_LPSPI0_SCK_4            (PIN_PORTE | PIN1  | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT2  | IMCR(741))
#define PIN_LPSPI0_SIN_1            (PIN_PORTC | PIN9  | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT2  | IMCR(742))
#define PIN_LPSPI0_SIN_2            (PIN_PORTD | PIN10 | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT4  | IMCR(742))
#define PIN_LPSPI0_SIN_3            (PIN_PORTD | PIN16 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT3  | IMCR(742))
#define PIN_LPSPI0_SIN_4            (PIN_PORTE | PIN0  | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(742))
#define PIN_LPSPI0_SOUT_1           (PIN_PORTA | PIN30 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT4  | IMCR(743))
#define PIN_LPSPI0_SOUT_2           (PIN_PORTB | PIN1  | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT3  | IMCR(743))
#define PIN_LPSPI0_SOUT_3           (PIN_PORTB | PIN4  | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT2  | IMCR(743))
#define PIN_LPSPI0_SOUT_4           (PIN_PORTD | PIN12 | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT5  | IMCR(743))
#define PIN_LPSPI0_SOUT_5           (PIN_PORTE | PIN2  | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(743))

#define PIN_LPSPI1_PCS0_1           (PIN_PORTA | PIN11 | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT2  | IMCR(744))
#define PIN_LPSPI1_PCS0_2           (PIN_PORTA | PIN21 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT3  | IMCR(744))
#define PIN_LPSPI1_PCS0_3           (PIN_PORTA | PIN26 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT5  | IMCR(744))
#define PIN_LPSPI1_PCS0_4           (PIN_PORTD | PIN3  | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT1  | IMCR(744))
#define PIN_LPSPI1_PCS0_5           (PIN_PORTF | PIN21 | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT4  | IMCR(744))
#define PIN_LPSPI1_PCS1_1           (PIN_PORTA | PIN6  | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT1  | IMCR(745))
#define PIN_LPSPI1_PCS1_2           (PIN_PORTA | PIN22 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT3  | IMCR(745))
#define PIN_LPSPI1_PCS1_3           (PIN_PORTB | PIN18 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT2  | IMCR(745))
#define PIN_LPSPI1_PCS1_4           (PIN_PORTC | PIN6  | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT4  | IMCR(745))
#define PIN_LPSPI1_PCS1_5           (PIN_PORTD | PIN4  | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT6  | IMCR(745))
#define PIN_LPSPI1_PCS1_6           (PIN_PORTE | PIN4  | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT5  | IMCR(745))
#define PIN_LPSPI1_PCS2_1           (PIN_PORTA | PIN16 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT2  | IMCR(746))
#define PIN_LPSPI1_PCS2_2           (PIN_PORTD | PIN20 | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT1  | IMCR(746))
#define PIN_LPSPI1_PCS3_1           (PIN_PORTA | PIN14 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT2  | IMCR(747))
#define PIN_LPSPI1_PCS3_2           (PIN_PORTB | PIN17 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT1  | IMCR(747))
#define PIN_LPSPI1_PCS4             (PIN_PORTA | PIN13 | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT1  | IMCR(748))
#define PIN_LPSPI1_PCS5             (PIN_PORTA | PIN12 | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT1  | IMCR(749))
#define PIN_LPSPI1_SCK_1            (PIN_PORTA | PIN3  | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT1  | IMCR(750))
#define PIN_LPSPI1_SCK_2            (PIN_PORTA | PIN19 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT3  | IMCR(750))
#define PIN_LPSPI1_SCK_3            (PIN_PORTA | PIN28 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT4  | IMCR(750))
#define PIN_LPSPI1_SCK_4            (PIN_PORTB | PIN14 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT2  | IMCR(750))
#define PIN_LPSPI1_SIN_1            (PIN_PORTA | PIN2  | PIN_INPUT_ALT2  | IMCR(751))
#define PIN_LPSPI1_SIN_2            (PIN_PORTA | PIN20 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT3  | IMCR(751))
#define PIN_LPSPI1_SIN_3            (PIN_PORTA | PIN29 | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT4  | IMCR(751))
#define PIN_LPSPI1_SIN_4            (PIN_PORTB | PIN15 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT1  | IMCR(751))
#define PIN_LPSPI1_SOUT_1           (PIN_PORTA | PIN18 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT4  | IMCR(752))
#define PIN_LPSPI1_SOUT_2           (PIN_PORTA | PIN30 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT5  | IMCR(752))
#define PIN_LPSPI1_SOUT_3           (PIN_PORTB | PIN16 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT2  | IMCR(752))
#define PIN_LPSPI1_SOUT_4           (PIN_PORTD | PIN2  | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT1  | IMCR(752))

#define PIN_LPSPI2_PCS0_1           (PIN_PORTA | PIN9  | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT1  | IMCR(753))
#define PIN_LPSPI2_PCS0_2           (PIN_PORTB | PIN25 | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT4  | IMCR(753))
#define PIN_LPSPI2_PCS0_3           (PIN_PORTC | PIN14 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT2  | IMCR(753))
#define PIN_LPSPI2_PCS0_4           (PIN_PORTE | PIN11 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT3  | IMCR(753))
#define PIN_LPSPI2_PCS0_5           (PIN_PORTE | PIN13 | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT5  | IMCR(753))
#define PIN_LPSPI2_PCS0_6           (PIN_PORTF | PIN3  | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT6  | IMCR(753))
#define PIN_LPSPI2_PCS1_1           (PIN_PORTC | PIN10 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT3  | IMCR(754))
#define PIN_LPSPI2_PCS1_2           (PIN_PORTC | PIN12 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT4  | IMCR(754))
#define PIN_LPSPI2_PCS1_3           (PIN_PORTC | PIN19 | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT2  | IMCR(754))
#define PIN_LPSPI2_PCS1_4           (PIN_PORTE | PIN10 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT1  | IMCR(754))
#define PIN_LPSPI2_PCS2_1           (PIN_PORTA | PIN21 | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT1  | IMCR(755))
#define PIN_LPSPI2_PCS2_2           (PIN_PORTE | PIN13 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT2  | IMCR(755))
#define PIN_LPSPI2_PCS2_3           (PIN_PORTF | PIN25 | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT3  | IMCR(755))
#define PIN_LPSPI2_PCS3_1           (PIN_PORTA | PIN15 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT1  | IMCR(756))
#define PIN_LPSPI2_PCS3_2           (PIN_PORTF | PIN26 | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT2  | IMCR(756))
#define PIN_LPSPI2_SCK_1            (PIN_PORTB | PIN29 | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT3  | IMCR(757))
#define PIN_LPSPI2_SCK_2            (PIN_PORTC | PIN15 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT2  | IMCR(757))
#define PIN_LPSPI2_SCK_3            (PIN_PORTE | PIN15 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT1  | IMCR(757))
#define PIN_LPSPI2_SCK_4            (PIN_PORTF | PIN0  | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT4  | IMCR(757))
#define PIN_LPSPI2_SIN_1            (PIN_PORTB | PIN2  | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT2  | IMCR(758))
#define PIN_LPSPI2_SIN_2            (PIN_PORTB | PIN28 | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT3  | IMCR(758))
#define PIN_LPSPI2_SIN_3            (PIN_PORTE | PIN16 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT1  | IMCR(758))
#define PIN_LPSPI2_SIN_4            (PIN_PORTF | PIN1  | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT4  | IMCR(758))
#define PIN_LPSPI2_SOUT_1           (PIN_PORTA | PIN8  | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT1  | IMCR(759))
#define PIN_LPSPI2_SOUT_2           (PIN_PORTB | PIN3  | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT2  | IMCR(759))
#define PIN_LPSPI2_SOUT_3           (PIN_PORTB | PIN27 | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT3  | IMCR(759))
#define PIN_LPSPI2_SOUT_4           (PIN_PORTF | PIN2  | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT4  | IMCR(759))

#define PIN_LPSPI3_PCS0_1           (PIN_PORTA | PIN9  | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT3  | IMCR(760))
#define PIN_LPSPI3_PCS0_2           (PIN_PORTB | PIN17 | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT2  | IMCR(760))
#define PIN_LPSPI3_PCS0_3           (PIN_PORTD | PIN17 | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT1  | IMCR(760))
#define PIN_LPSPI3_PCS0_4           (PIN_PORTF | PIN16 | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT4  | IMCR(760))
#define PIN_LPSPI3_PCS1_1           (PIN_PORTA | PIN6  | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT5  | IMCR(761))
#define PIN_LPSPI3_PCS1_2           (PIN_PORTB | PIN22 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT4  | IMCR(761))
#define PIN_LPSPI3_PCS1_3           (PIN_PORTE | PIN8  | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT1  | IMCR(761))
#define PIN_LPSPI3_PCS1_4           (PIN_PORTF | PIN18 | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT2  | IMCR(761))
#define PIN_LPSPI3_PCS1_5           (PIN_PORTF | PIN29 | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT3  | IMCR(761))
#define PIN_LPSPI3_PCS2_1           (PIN_PORTB | PIN13 | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT1  | IMCR(762))
#define PIN_LPSPI3_PCS2_2           (PIN_PORTC | PIN2  | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT4  | IMCR(762))
#define PIN_LPSPI3_PCS2_3           (PIN_PORTF | PIN19 | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT2  | IMCR(762))
#define PIN_LPSPI3_PCS3_1           (PIN_PORTB | PIN12 | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT1  | IMCR(763))
#define PIN_LPSPI3_PCS3_2           (PIN_PORTD | PIN7  | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT5  | IMCR(763))
#define PIN_LPSPI3_PCS3_3           (PIN_PORTF | PIN20 | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT2  | IMCR(763))
#define PIN_LPSPI3_PCS3_4           (PIN_PORTF | PIN23 | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT3  | IMCR(763))
#define PIN_LPSPI3_SCK_1            (PIN_PORTC | PIN17 | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT3  | IMCR(764))
#define PIN_LPSPI3_SCK_2            (PIN_PORTD | PIN1  | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT1  | IMCR(764))
#define PIN_LPSPI3_SCK_3            (PIN_PORTE | PIN7  | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT2  | IMCR(764))
#define PIN_LPSPI3_SCK_4            (PIN_PORTF | PIN13 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT4  | IMCR(764))
#define PIN_LPSPI3_SIN_1            (PIN_PORTC | PIN16 | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT3  | IMCR(765))
#define PIN_LPSPI3_SIN_2            (PIN_PORTD | PIN20 | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT2  | IMCR(765))
#define PIN_LPSPI3_SIN_3            (PIN_PORTE | PIN10 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(765))
#define PIN_LPSPI3_SIN_4            (PIN_PORTF | PIN12 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT4  | IMCR(765))
#define PIN_LPSPI3_SOUT_1           (PIN_PORTA | PIN17 | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT2  | IMCR(766))
#define PIN_LPSPI3_SOUT_2           (PIN_PORTD | PIN0  | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT1  | IMCR(766))
#define PIN_LPSPI3_SOUT_3           (PIN_PORTD | PIN8  | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT3  | IMCR(766))
#define PIN_LPSPI3_SOUT_4           (PIN_PORTF | PIN15 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT4  | IMCR(766))

