apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k344_pinmux.h
#define PIN_LPSPI4_PCS0_1           (PIN_PORTB | PIN8  | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT2  | IMCR(767))
#define PIN_LPSPI4_PCS0_2           (PIN_PORTC | PIN10 | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT1  | IMCR(767))
#define PIN_LPSPI4_PCS0_3           (PIN_PORTE | PIN23 | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT4  | IMCR(767))
#define PIN_LPSPI4_PCS0_4           (PIN_PORTF | PIN25 | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT3  | IMCR(767))
#define PIN_LPSPI4_PCS1_1           (PIN_PORTA | PIN1  | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT1  | IMCR(768))
#define PIN_LPSPI4_PCS1_2           (PIN_PORTC | PIN25 | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT4  | IMCR(768))
#define PIN_LPSPI4_PCS1_3           (PIN_PORTE | PIN24 | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT3  | IMCR(768))
#define PIN_LPSPI4_PCS1_4           (PIN_PORTF | PIN26 | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT2  | IMCR(768))
#define PIN_LPSPI4_PCS2_1           (PIN_PORTA | PIN0  | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT1  | IMCR(769))
#define PIN_LPSPI4_PCS2_2           (PIN_PORTF | PIN22 | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT2  | IMCR(769))
#define PIN_LPSPI4_PCS2_3           (PIN_PORTF | PIN27 | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT3  | IMCR(769))
#define PIN_LPSPI4_PCS3_1           (PIN_PORTA | PIN16 | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT1  | IMCR(770))
#define PIN_LPSPI4_PCS3_2           (PIN_PORTF | PIN28 | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT2  | IMCR(770))
#define PIN_LPSPI4_PCS3_3           (PIN_PORTG | PIN12 | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT3  | IMCR(770))
#define PIN_LPSPI4_SCK_1            (PIN_PORTB | PIN10 | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT2  | IMCR(771))
#define PIN_LPSPI4_SCK_2            (PIN_PORTC | PIN27 | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT1  | IMCR(771))
#define PIN_LPSPI4_SCK_3            (PIN_PORTE | PIN22 | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT3  | IMCR(771))
#define PIN_LPSPI4_SIN_1            (PIN_PORTB | PIN11 | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT2  | IMCR(772))
#define PIN_LPSPI4_SIN_2            (PIN_PORTC | PIN26 | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT1  | IMCR(772))
#define PIN_LPSPI4_SIN_3            (PIN_PORTE | PIN21 | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT3  | IMCR(772))
#define PIN_LPSPI4_SOUT_1           (PIN_PORTB | PIN9  | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT2  | IMCR(773))
#define PIN_LPSPI4_SOUT_2           (PIN_PORTC | PIN11 | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT1  | IMCR(773))
#define PIN_LPSPI4_SOUT_3           (PIN_PORTE | PIN25 | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT3  | IMCR(773))

#define PIN_LPSPI5_PCS0_1           (PIN_PORTA | PIN15 | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT3  | IMCR(774))
#define PIN_LPSPI5_PCS0_2           (PIN_PORTD | PIN4  | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT2  | IMCR(774))
#define PIN_LPSPI5_PCS0_3           (PIN_PORTD | PIN17 | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT1  | IMCR(774))
#define PIN_LPSPI5_PCS1_1           (PIN_PORTA | PIN14 | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT2  | IMCR(775))
#define PIN_LPSPI5_PCS1_2           (PIN_PORTE | PIN8  | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT1  | IMCR(775))
#define PIN_LPSPI5_PCS2             (PIN_PORTD | PIN29 | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT1  | IMCR(776))
#define PIN_LPSPI5_PCS3             (PIN_PORTD | PIN30 | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT1  | IMCR(777))
#define PIN_LPSPI5_SCK_1            (PIN_PORTA | PIN3  | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT2  | IMCR(778))
#define PIN_LPSPI5_SCK_2            (PIN_PORTD | PIN14 | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT1  | IMCR(778))
#define PIN_LPSPI5_SCK_3            (PIN_PORTD | PIN26 | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT3  | IMCR(778))
#define PIN_LPSPI5_SIN_1            (PIN_PORTA | PIN2  | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT2  | IMCR(779))
#define PIN_LPSPI5_SIN_2            (PIN_PORTD | PIN13 | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT1  | IMCR(779))
#define PIN_LPSPI5_SIN_3            (PIN_PORTD | PIN28 | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT3  | IMCR(779))
#define PIN_LPSPI5_SOUT_1           (PIN_PORTD | PIN2  | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT2  | IMCR(780))
#define PIN_LPSPI5_SOUT_2           (PIN_PORTD | PIN27 | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT3  | IMCR(780))
#define PIN_LPSPI5_SOUT_3           (PIN_PORTE | PIN9  | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT1  | IMCR(780))

/* LPUART */

#define PIN_LPUART0_CTS_1           (PIN_PORTA | PIN0  | PIN_INPUT_ALT1  | IMCR(872))
#define PIN_LPUART0_CTS_2           (PIN_PORTC | PIN8  | PIN_INPUT_ALT2  | IMCR(872))
#define PIN_LPUART0_RTS_1           (PIN_PORTA | PIN1  | PIN_OUTPUT_ALT3)
#define PIN_LPUART0_RTS_2           (PIN_PORTC | PIN9  | PIN_OUTPUT_ALT3)
#define PIN_LPUART0_RX_1            (PIN_PORTA | PIN2  | PIN_INPUT_ALT1  | IMCR(699))
#define PIN_LPUART0_RX_2            (PIN_PORTA | PIN28 | PIN_INPUT_ALT4  | IMCR(699))
#define PIN_LPUART0_RX_3            (PIN_PORTB | PIN0  | PIN_INPUT_ALT2  | IMCR(699))
#define PIN_LPUART0_RX_4            (PIN_PORTC | PIN2  | PIN_INPUT_ALT3  | IMCR(699))
#define PIN_LPUART0_TX_1            (PIN_PORTA | PIN3  | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT1  | IMCR(875))
#define PIN_LPUART0_TX_2            (PIN_PORTA | PIN27 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT4  | IMCR(875))
#define PIN_LPUART0_TX_3            (PIN_PORTB | PIN1  | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT2  | IMCR(875))
#define PIN_LPUART0_TX_4            (PIN_PORTC | PIN3  | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT3  | IMCR(875))

#define PIN_LPUART1_CTS_1           (PIN_PORTA | PIN6  | PIN_INPUT_ALT2  | IMCR(873))
#define PIN_LPUART1_CTS_2           (PIN_PORTE | PIN2  | PIN_INPUT_ALT1  | IMCR(873))
#define PIN_LPUART1_CTS_3           (PIN_PORTE | PIN15 | PIN_INPUT_ALT3  | IMCR(873))
#define PIN_LPUART1_RTS_1           (PIN_PORTA | PIN7  | PIN_OUTPUT_ALT5)
#define PIN_LPUART1_RTS_2           (PIN_PORTE | PIN6  | PIN_OUTPUT_ALT3)
#define PIN_LPUART1_RTS_3           (PIN_PORTE | PIN16 | PIN_OUTPUT_ALT5)
#define PIN_LPUART1_RX_1            (PIN_PORTA | PIN19 | PIN_INPUT_ALT5  | IMCR(700))
#define PIN_LPUART1_RX_2            (PIN_PORTB | PIN23 | PIN_INPUT_ALT4  | IMCR(700))
#define PIN_LPUART1_RX_3            (PIN_PORTC | PIN6  | PIN_INPUT_ALT1  | IMCR(700))
#define PIN_LPUART1_RX_4            (PIN_PORTC | PIN8  | PIN_INPUT_ALT2  | IMCR(700))
#define PIN_LPUART1_RX_5            (PIN_PORTD | PIN13 | PIN_INPUT_ALT3  | IMCR(700))
#define PIN_LPUART1_TX_1            (PIN_PORTA | PIN18 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT4  | IMCR(876))
#define PIN_LPUART1_TX_2            (PIN_PORTB | PIN22 | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT5  | IMCR(876))
#define PIN_LPUART1_TX_3            (PIN_PORTC | PIN7  | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(876))
#define PIN_LPUART1_TX_4            (PIN_PORTC | PIN9  | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT2  | IMCR(876))
#define PIN_LPUART1_TX_5            (PIN_PORTD | PIN14 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT3  | IMCR(876))

#define PIN_LPUART2_CTS_1           (PIN_PORTD | PIN11 | PIN_INPUT_ALT1  | IMCR(874))
#define PIN_LPUART2_CTS_2           (PIN_PORTD | PIN15 | PIN_INPUT_ALT2  | IMCR(874))
#define PIN_LPUART2_CTS_3           (PIN_PORTE | PIN9  | PIN_INPUT_ALT3  | IMCR(874))
#define PIN_LPUART2_RTS_1           (PIN_PORTD | PIN12 | PIN_OUTPUT_ALT3)
#define PIN_LPUART2_RTS_2           (PIN_PORTD | PIN16 | PIN_OUTPUT_ALT6)
#define PIN_LPUART2_RTS_3           (PIN_PORTE | PIN3  | PIN_OUTPUT_ALT5)
#define PIN_LPUART2_RX_1            (PIN_PORTA | PIN8  | PIN_INPUT_ALT3  | IMCR(701))
#define PIN_LPUART2_RX_2            (PIN_PORTA | PIN30 | PIN_INPUT_ALT4  | IMCR(701))
#define PIN_LPUART2_RX_3            (PIN_PORTC | PIN16 | PIN_INPUT_ALT5  | IMCR(701))
#define PIN_LPUART2_RX_4            (PIN_PORTD | PIN6  | PIN_INPUT_ALT1  | IMCR(701))
#define PIN_LPUART2_RX_5            (PIN_PORTD | PIN17 | PIN_INPUT_ALT2  | IMCR(701))
#define PIN_LPUART2_TX_1            (PIN_PORTA | PIN9  | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT1  | IMCR(877))
#define PIN_LPUART2_TX_2            (PIN_PORTA | PIN29 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT5  | IMCR(877))
#define PIN_LPUART2_TX_3            (PIN_PORTC | PIN15 | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT2  | IMCR(877))
#define PIN_LPUART2_TX_4            (PIN_PORTD | PIN7  | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT3  | IMCR(877))
#define PIN_LPUART2_TX_5            (PIN_PORTE | PIN12 | PIN_OUTPUT_ALT3 | PIN_INPUT_ALT4  | IMCR(877))

#define PIN_LPUART3_RX_1            (PIN_PORTA | PIN6  | PIN_INPUT_ALT2  | IMCR(702))
#define PIN_LPUART3_RX_2            (PIN_PORTD | PIN3  | PIN_INPUT_ALT3  | IMCR(702))
#define PIN_LPUART3_RX_3            (PIN_PORTE | PIN15 | PIN_INPUT_ALT1  | IMCR(702))
#define PIN_LPUART3_TX_1            (PIN_PORTA | PIN7  | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT1  | IMCR(878))
#define PIN_LPUART3_TX_2            (PIN_PORTD | PIN2  | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT2  | IMCR(878))
#define PIN_LPUART3_TX_3            (PIN_PORTE | PIN16 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT3  | IMCR(878))

#define PIN_LPUART4_RX_1            (PIN_PORTB | PIN17 | PIN_INPUT_ALT3  | IMCR(703))
#define PIN_LPUART4_RX_2            (PIN_PORTE | PIN7  | PIN_INPUT_ALT4  | IMCR(703))
#define PIN_LPUART4_RX_3            (PIN_PORTE | PIN10 | PIN_INPUT_ALT2  | IMCR(703))
#define PIN_LPUART4_TX_1            (PIN_PORTA | PIN17 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT1  | IMCR(879))
#define PIN_LPUART4_TX_2            (PIN_PORTB | PIN16 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT2  | IMCR(879))
#define PIN_LPUART4_TX_3            (PIN_PORTE | PIN11 | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT3  | IMCR(879))

#define PIN_LPUART5_RX_1            (PIN_PORTB | PIN28 | PIN_INPUT_ALT4  | IMCR(704))
#define PIN_LPUART5_RX_2            (PIN_PORTD | PIN0  | PIN_INPUT_ALT2  | IMCR(704))
#define PIN_LPUART5_RX_3            (PIN_PORTE | PIN3  | PIN_INPUT_ALT1  | IMCR(704))
#define PIN_LPUART5_RX_4            (PIN_PORTF | PIN1  | PIN_INPUT_ALT3  | IMCR(704))
#define PIN_LPUART5_TX_1            (PIN_PORTB | PIN27 | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT3  | IMCR(880))
#define PIN_LPUART5_TX_2            (PIN_PORTD | PIN1  | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT1  | IMCR(880))
#define PIN_LPUART5_TX_3            (PIN_PORTE | PIN14 | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT2  | IMCR(880))
#define PIN_LPUART5_TX_4            (PIN_PORTF | PIN0  | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT4  | IMCR(880))

