apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k344_pinmux.h
#define PIN_LPUART6_RX_1            (PIN_PORTA | PIN15 | PIN_INPUT_ALT2  | IMCR(705))
#define PIN_LPUART6_RX_2            (PIN_PORTC | PIN18 | PIN_INPUT_ALT4  | IMCR(705))
#define PIN_LPUART6_RX_3            (PIN_PORTD | PIN8  | PIN_INPUT_ALT1  | IMCR(705))
#define PIN_LPUART6_RX_4            (PIN_PORTF | PIN3  | PIN_INPUT_ALT3  | IMCR(705))
#define PIN_LPUART6_TX_1            (PIN_PORTA | PIN16 | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT1  | IMCR(881))
#define PIN_LPUART6_TX_2            (PIN_PORTB | PIN29 | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT3  | IMCR(881))
#define PIN_LPUART6_TX_3            (PIN_PORTD | PIN9  | PIN_OUTPUT_ALT4 | PIN_INPUT_ALT2  | IMCR(881))
#define PIN_LPUART6_TX_4            (PIN_PORTF | PIN2  | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT4  | IMCR(881))

#define PIN_LPUART7_RX_1            (PIN_PORTB | PIN14 | PIN_INPUT_ALT1  | IMCR(706))
#define PIN_LPUART7_RX_2            (PIN_PORTC | PIN20 | PIN_INPUT_ALT4  | IMCR(706))
#define PIN_LPUART7_RX_3            (PIN_PORTE | PIN0  | PIN_INPUT_ALT2  | IMCR(706))
#define PIN_LPUART7_RX_4            (PIN_PORTF | PIN19 | PIN_INPUT_ALT3  | IMCR(706))
#define PIN_LPUART7_TX_1            (PIN_PORTB | PIN15 | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT1  | IMCR(882))
#define PIN_LPUART7_TX_2            (PIN_PORTC | PIN19 | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT2  | IMCR(882))
#define PIN_LPUART7_TX_3            (PIN_PORTE | PIN1  | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT3  | IMCR(882))
#define PIN_LPUART7_TX_4            (PIN_PORTF | PIN18 | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT4  | IMCR(882))

#define PIN_LPUART8_RX_1            (PIN_PORTB | PIN12 | PIN_INPUT_ALT1  | IMCR(707))
#define PIN_LPUART8_RX_2            (PIN_PORTD | PIN15 | PIN_INPUT_ALT2  | IMCR(707))
#define PIN_LPUART8_RX_3            (PIN_PORTF | PIN21 | PIN_INPUT_ALT3  | IMCR(707))
#define PIN_LPUART8_TX_1            (PIN_PORTB | PIN13 | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT1  | IMCR(883))
#define PIN_LPUART8_TX_2            (PIN_PORTD | PIN16 | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT2  | IMCR(883))
#define PIN_LPUART8_TX_3            (PIN_PORTF | PIN20 | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT3  | IMCR(883))

#define PIN_LPUART9_RX_1            (PIN_PORTB | PIN2  | PIN_INPUT_ALT2  | IMCR(708))
#define PIN_LPUART9_RX_2            (PIN_PORTB | PIN9  | PIN_INPUT_ALT1  | IMCR(708))
#define PIN_LPUART9_RX_3            (PIN_PORTF | PIN24 | PIN_INPUT_ALT3  | IMCR(708))
#define PIN_LPUART9_TX_1            (PIN_PORTB | PIN3  | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT1  | IMCR(884))
#define PIN_LPUART9_TX_2            (PIN_PORTB | PIN10 | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT2  | IMCR(884))
#define PIN_LPUART9_TX_3            (PIN_PORTF | PIN23 | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT3  | IMCR(884))

#define PIN_LPUART10_RX_1           (PIN_PORTC | PIN12 | PIN_INPUT_ALT2  | IMCR(709))
#define PIN_LPUART10_RX_2           (PIN_PORTE | PIN2  | PIN_INPUT_ALT1  | IMCR(709))
#define PIN_LPUART10_RX_3           (PIN_PORTF | PIN13 | PIN_INPUT_ALT3  | IMCR(709))
#define PIN_LPUART10_TX_1           (PIN_PORTC | PIN13 | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT1  | IMCR(885))
#define PIN_LPUART10_TX_2           (PIN_PORTE | PIN6  | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT2  | IMCR(885))
#define PIN_LPUART10_TX_3           (PIN_PORTF | PIN12 | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT3  | IMCR(885))

#define PIN_LPUART11_RX_1           (PIN_PORTA | PIN12 | PIN_INPUT_ALT2  | IMCR(710))
#define PIN_LPUART11_RX_2           (PIN_PORTC | PIN11 | PIN_INPUT_ALT1  | IMCR(710))
#define PIN_LPUART11_RX_3           (PIN_PORTF | PIN28 | PIN_INPUT_ALT3  | IMCR(710))
#define PIN_LPUART11_TX_1           (PIN_PORTA | PIN13 | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT1  | IMCR(886))
#define PIN_LPUART11_TX_2           (PIN_PORTC | PIN10 | PIN_OUTPUT_ALT2 | PIN_INPUT_ALT2  | IMCR(886))
#define PIN_LPUART11_TX_3           (PIN_PORTF | PIN27 | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT3  | IMCR(886))

#define PIN_LPUART12_RX_1           (PIN_PORTC | PIN25 | PIN_INPUT_ALT2  | IMCR(711))
#define PIN_LPUART12_RX_2           (PIN_PORTE | PIN5  | PIN_INPUT_ALT1  | IMCR(711))
#define PIN_LPUART12_RX_3           (PIN_PORTF | PIN17 | PIN_INPUT_ALT3  | IMCR(711))
#define PIN_LPUART12_TX_1           (PIN_PORTC | PIN24 | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT1  | IMCR(887))
#define PIN_LPUART12_TX_2           (PIN_PORTE | PIN4  | PIN_OUTPUT_ALT5 | PIN_INPUT_ALT2  | IMCR(887))
#define PIN_LPUART12_TX_3           (PIN_PORTF | PIN16 | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT3  | IMCR(887))

#define PIN_LPUART13_RX_1           (PIN_PORTB | PIN19 | PIN_INPUT_ALT1  | IMCR(712))
#define PIN_LPUART13_RX_2           (PIN_PORTC | PIN27 | PIN_INPUT_ALT2  | IMCR(712))
#define PIN_LPUART13_RX_3           (PIN_PORTG | PIN1  | PIN_INPUT_ALT3  | IMCR(712))
#define PIN_LPUART13_TX_1           (PIN_PORTB | PIN18 | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT1  | IMCR(888))
#define PIN_LPUART13_TX_2           (PIN_PORTC | PIN26 | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT2  | IMCR(888))
#define PIN_LPUART13_TX_3           (PIN_PORTG | PIN0  | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT3  | IMCR(888))

#define PIN_LPUART14_RX_1           (PIN_PORTB | PIN21 | PIN_INPUT_ALT1  | IMCR(713))
#define PIN_LPUART14_RX_2           (PIN_PORTD | PIN27 | PIN_INPUT_ALT2  | IMCR(713))
#define PIN_LPUART14_RX_3           (PIN_PORTG | PIN3  | PIN_INPUT_ALT3  | IMCR(713))
#define PIN_LPUART14_TX_1           (PIN_PORTB | PIN20 | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT1  | IMCR(889))
#define PIN_LPUART14_TX_2           (PIN_PORTD | PIN26 | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT2  | IMCR(889))
#define PIN_LPUART14_TX_3           (PIN_PORTG | PIN2  | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT3  | IMCR(889))

#define PIN_LPUART15_RX_1           (PIN_PORTB | PIN26 | PIN_INPUT_ALT1  | IMCR(714))
#define PIN_LPUART15_RX_2           (PIN_PORTD | PIN29 | PIN_INPUT_ALT2  | IMCR(714))
#define PIN_LPUART15_RX_3           (PIN_PORTG | PIN5  | PIN_INPUT_ALT3  | IMCR(714))
#define PIN_LPUART15_TX_1           (PIN_PORTB | PIN25 | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT1  | IMCR(890))
#define PIN_LPUART15_TX_2           (PIN_PORTD | PIN28 | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT2  | IMCR(890))
#define PIN_LPUART15_TX_3           (PIN_PORTG | PIN4  | PIN_OUTPUT_ALT1 | PIN_INPUT_ALT3  | IMCR(890))

/* GPIO */

#define PIN_PTA0                    (PIN_PORTA | PIN0)
#define PIN_PTA1                    (PIN_PORTA | PIN1)
#define PIN_PTA2                    (PIN_PORTA | PIN2)
#define PIN_PTA3                    (PIN_PORTA | PIN3)
#define PIN_PTA4                    (PIN_PORTA | PIN4)
#define PIN_PTA5                    (PIN_PORTA | PIN5)
#define PIN_PTA6                    (PIN_PORTA | PIN6)
#define PIN_PTA7                    (PIN_PORTA | PIN7)
#define PIN_PTA8                    (PIN_PORTA | PIN8)
#define PIN_PTA9                    (PIN_PORTA | PIN9)
#define PIN_PTA10                   (PIN_PORTA | PIN10)
#define PIN_PTA11                   (PIN_PORTA | PIN11)
#define PIN_PTA12                   (PIN_PORTA | PIN12)
#define PIN_PTA13                   (PIN_PORTA | PIN13)
#define PIN_PTA14                   (PIN_PORTA | PIN14)
#define PIN_PTA15                   (PIN_PORTA | PIN15)
#define PIN_PTA16                   (PIN_PORTA | PIN16)
#define PIN_PTA17                   (PIN_PORTA | PIN17)
#define PIN_PTA18                   (PIN_PORTA | PIN18)
#define PIN_PTA19                   (PIN_PORTA | PIN19)
#define PIN_PTA20                   (PIN_PORTA | PIN20)
#define PIN_PTA21                   (PIN_PORTA | PIN21)
#define PIN_PTA22                   (PIN_PORTA | PIN22)
#define PIN_PTA23                   (PIN_PORTA | PIN23)
#define PIN_PTA24                   (PIN_PORTA | PIN24)
#define PIN_PTA25                   (PIN_PORTA | PIN25)
#define PIN_PTA26                   (PIN_PORTA | PIN26)
#define PIN_PTA27                   (PIN_PORTA | PIN27)
#define PIN_PTA28                   (PIN_PORTA | PIN28)
#define PIN_PTA29                   (PIN_PORTA | PIN29)
#define PIN_PTA30                   (PIN_PORTA | PIN30)
#define PIN_PTA31                   (PIN_PORTA | PIN31)

