apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k344_pinmux.h
#define PIN_PTB0                    (PIN_PORTB | PIN0)
#define PIN_PTB1                    (PIN_PORTB | PIN1)
#define PIN_PTB2                    (PIN_PORTB | PIN2)
#define PIN_PTB3                    (PIN_PORTB | PIN3)
#define PIN_PTB4                    (PIN_PORTB | PIN4)
#define PIN_PTB5                    (PIN_PORTB | PIN5)
#define PIN_PTB8                    (PIN_PORTB | PIN8)
#define PIN_PTB9                    (PIN_PORTB | PIN9)
#define PIN_PTB10                   (PIN_PORTB | PIN10)
#define PIN_PTB11                   (PIN_PORTB | PIN11)
#define PIN_PTB12                   (PIN_PORTB | PIN12)
#define PIN_PTB13                   (PIN_PORTB | PIN13)
#define PIN_PTB14                   (PIN_PORTB | PIN14)
#define PIN_PTB15                   (PIN_PORTB | PIN15)
#define PIN_PTB16                   (PIN_PORTB | PIN16)
#define PIN_PTB17                   (PIN_PORTB | PIN17)
#define PIN_PTB18                   (PIN_PORTB | PIN18)
#define PIN_PTB19                   (PIN_PORTB | PIN19)
#define PIN_PTB20                   (PIN_PORTB | PIN20)
#define PIN_PTB21                   (PIN_PORTB | PIN21)
#define PIN_PTB22                   (PIN_PORTB | PIN22)
#define PIN_PTB23                   (PIN_PORTB | PIN23)
#define PIN_PTB24                   (PIN_PORTB | PIN24)
#define PIN_PTB25                   (PIN_PORTB | PIN25)
#define PIN_PTB26                   (PIN_PORTB | PIN26)
#define PIN_PTB27                   (PIN_PORTB | PIN27)
#define PIN_PTB28                   (PIN_PORTB | PIN28)
#define PIN_PTB29                   (PIN_PORTB | PIN29)
#define PIN_PTB30                   (PIN_PORTB | PIN30)
#define PIN_PTB31                   (PIN_PORTB | PIN31)

#define PIN_PTC0                    (PIN_PORTC | PIN0)
#define PIN_PTC1                    (PIN_PORTC | PIN1)
#define PIN_PTC2                    (PIN_PORTC | PIN2)
#define PIN_PTC3                    (PIN_PORTC | PIN3)
#define PIN_PTC4                    (PIN_PORTC | PIN4)
#define PIN_PTC5                    (PIN_PORTC | PIN5)
#define PIN_PTC6                    (PIN_PORTC | PIN6)
#define PIN_PTC7                    (PIN_PORTC | PIN7)
#define PIN_PTC8                    (PIN_PORTC | PIN8)
#define PIN_PTC9                    (PIN_PORTC | PIN9)
#define PIN_PTC10                   (PIN_PORTC | PIN10)
#define PIN_PTC11                   (PIN_PORTC | PIN11)
#define PIN_PTC12                   (PIN_PORTC | PIN12)
#define PIN_PTC13                   (PIN_PORTC | PIN13)
#define PIN_PTC14                   (PIN_PORTC | PIN14)
#define PIN_PTC15                   (PIN_PORTC | PIN15)
#define PIN_PTC16                   (PIN_PORTC | PIN16)
#define PIN_PTC17                   (PIN_PORTC | PIN17)
#define PIN_PTC18                   (PIN_PORTC | PIN18)
#define PIN_PTC19                   (PIN_PORTC | PIN19)
#define PIN_PTC20                   (PIN_PORTC | PIN20)
#define PIN_PTC21                   (PIN_PORTC | PIN21)
#define PIN_PTC22                   (PIN_PORTC | PIN22)
#define PIN_PTC23                   (PIN_PORTC | PIN23)
#define PIN_PTC24                   (PIN_PORTC | PIN24)
#define PIN_PTC25                   (PIN_PORTC | PIN25)
#define PIN_PTC26                   (PIN_PORTC | PIN26)
#define PIN_PTC27                   (PIN_PORTC | PIN27)
#define PIN_PTC28                   (PIN_PORTC | PIN28)
#define PIN_PTC29                   (PIN_PORTC | PIN29)
#define PIN_PTC30                   (PIN_PORTC | PIN30)
#define PIN_PTC31                   (PIN_PORTC | PIN31)

#define PIN_PTD0                    (PIN_PORTD | PIN0)
#define PIN_PTD1                    (PIN_PORTD | PIN1)
#define PIN_PTD2                    (PIN_PORTD | PIN2)
#define PIN_PTD3                    (PIN_PORTD | PIN3)
#define PIN_PTD4                    (PIN_PORTD | PIN4)
#define PIN_PTD5                    (PIN_PORTD | PIN5)
#define PIN_PTD6                    (PIN_PORTD | PIN6)
#define PIN_PTD7                    (PIN_PORTD | PIN7)
#define PIN_PTD8                    (PIN_PORTD | PIN8)
#define PIN_PTD9                    (PIN_PORTD | PIN9)
#define PIN_PTD10                   (PIN_PORTD | PIN10)
#define PIN_PTD11                   (PIN_PORTD | PIN11)
#define PIN_PTD12                   (PIN_PORTD | PIN12)
#define PIN_PTD13                   (PIN_PORTD | PIN13)
#define PIN_PTD14                   (PIN_PORTD | PIN14)
#define PIN_PTD15                   (PIN_PORTD | PIN15)
#define PIN_PTD16                   (PIN_PORTD | PIN16)
#define PIN_PTD17                   (PIN_PORTD | PIN17)
#define PIN_PTD18                   (PIN_PORTD | PIN18)
#define PIN_PTD19                   (PIN_PORTD | PIN19)
#define PIN_PTD20                   (PIN_PORTD | PIN20)
#define PIN_PTD21                   (PIN_PORTD | PIN21)
#define PIN_PTD22                   (PIN_PORTD | PIN22)
#define PIN_PTD23                   (PIN_PORTD | PIN23)
#define PIN_PTD24                   (PIN_PORTD | PIN24)
#define PIN_PTD25                   (PIN_PORTD | PIN25)
#define PIN_PTD26                   (PIN_PORTD | PIN26)
#define PIN_PTD27                   (PIN_PORTD | PIN27)
#define PIN_PTD28                   (PIN_PORTD | PIN28)
#define PIN_PTD29                   (PIN_PORTD | PIN29)
#define PIN_PTD30                   (PIN_PORTD | PIN30)
#define PIN_PTD31                   (PIN_PORTD | PIN31)

#define PIN_PTE0                    (PIN_PORTE | PIN0)
#define PIN_PTE1                    (PIN_PORTE | PIN1)
#define PIN_PTE2                    (PIN_PORTE | PIN2)
#define PIN_PTE3                    (PIN_PORTE | PIN3)
#define PIN_PTE4                    (PIN_PORTE | PIN4)
#define PIN_PTE5                    (PIN_PORTE | PIN5)
#define PIN_PTE6                    (PIN_PORTE | PIN6)
#define PIN_PTE7                    (PIN_PORTE | PIN7)
#define PIN_PTE8                    (PIN_PORTE | PIN8)
#define PIN_PTE9                    (PIN_PORTE | PIN9)
#define PIN_PTE10                   (PIN_PORTE | PIN10)
#define PIN_PTE11                   (PIN_PORTE | PIN11)
#define PIN_PTE12                   (PIN_PORTE | PIN12)
#define PIN_PTE13                   (PIN_PORTE | PIN13)
#define PIN_PTE14                   (PIN_PORTE | PIN14)
#define PIN_PTE15                   (PIN_PORTE | PIN15)
#define PIN_PTE16                   (PIN_PORTE | PIN16)
#define PIN_PTE17                   (PIN_PORTE | PIN17)
#define PIN_PTE18                   (PIN_PORTE | PIN18)
#define PIN_PTE19                   (PIN_PORTE | PIN19)
#define PIN_PTE20                   (PIN_PORTE | PIN20)
#define PIN_PTE21                   (PIN_PORTE | PIN21)
#define PIN_PTE22                   (PIN_PORTE | PIN22)
#define PIN_PTE23                   (PIN_PORTE | PIN23)
#define PIN_PTE24                   (PIN_PORTE | PIN24)
#define PIN_PTE25                   (PIN_PORTE | PIN25)
#define PIN_PTE26                   (PIN_PORTE | PIN26)
#define PIN_PTE27                   (PIN_PORTE | PIN27)
#define PIN_PTE28                   (PIN_PORTE | PIN28)
#define PIN_PTE29                   (PIN_PORTE | PIN29)
#define PIN_PTE30                   (PIN_PORTE | PIN30)
#define PIN_PTE31                   (PIN_PORTE | PIN31)

#define PIN_PTF0                    (PIN_PORTF | PIN0)
#define PIN_PTF1                    (PIN_PORTF | PIN1)
#define PIN_PTF2                    (PIN_PORTF | PIN2)
#define PIN_PTF3                    (PIN_PORTF | PIN3)
#define PIN_PTF4                    (PIN_PORTF | PIN4)
#define PIN_PTF5                    (PIN_PORTF | PIN5)
#define PIN_PTF6                    (PIN_PORTF | PIN6)
#define PIN_PTF7                    (PIN_PORTF | PIN7)
#define PIN_PTF8                    (PIN_PORTF | PIN8)
#define PIN_PTF9                    (PIN_PORTF | PIN9)
#define PIN_PTF10                   (PIN_PORTF | PIN10)
#define PIN_PTF11                   (PIN_PORTF | PIN11)
#define PIN_PTF12                   (PIN_PORTF | PIN12)
#define PIN_PTF13                   (PIN_PORTF | PIN13)
#define PIN_PTF14                   (PIN_PORTF | PIN14)
#define PIN_PTF15                   (PIN_PORTF | PIN15)
#define PIN_PTF16                   (PIN_PORTF | PIN16)
#define PIN_PTF17                   (PIN_PORTF | PIN17)
#define PIN_PTF18                   (PIN_PORTF | PIN18)
#define PIN_PTF19                   (PIN_PORTF | PIN19)
#define PIN_PTF20                   (PIN_PORTF | PIN20)
#define PIN_PTF21                   (PIN_PORTF | PIN21)
#define PIN_PTF22                   (PIN_PORTF | PIN22)
#define PIN_PTF23                   (PIN_PORTF | PIN23)
#define PIN_PTF24                   (PIN_PORTF | PIN24)
#define PIN_PTF25                   (PIN_PORTF | PIN25)
#define PIN_PTF26                   (PIN_PORTF | PIN26)
#define PIN_PTF27                   (PIN_PORTF | PIN27)
#define PIN_PTF28                   (PIN_PORTF | PIN28)
#define PIN_PTF29                   (PIN_PORTF | PIN29)
#define PIN_PTF30                   (PIN_PORTF | PIN30)
#define PIN_PTF31                   (PIN_PORTF | PIN31)

#define PIN_PTG0                    (PIN_PORTG | PIN0)
#define PIN_PTG1                    (PIN_PORTG | PIN1)
#define PIN_PTG2                    (PIN_PORTG | PIN2)
#define PIN_PTG3                    (PIN_PORTG | PIN3)
#define PIN_PTG4                    (PIN_PORTG | PIN4)
#define PIN_PTG5                    (PIN_PORTG | PIN5)
#define PIN_PTG6                    (PIN_PORTG | PIN6)
#define PIN_PTG7                    (PIN_PORTG | PIN7)
#define PIN_PTG8                    (PIN_PORTG | PIN8)
#define PIN_PTG9                    (PIN_PORTG | PIN9)
#define PIN_PTG10                   (PIN_PORTG | PIN10)
#define PIN_PTG11                   (PIN_PORTG | PIN11)
#define PIN_PTG12                   (PIN_PORTG | PIN12)
#define PIN_PTG13                   (PIN_PORTG | PIN13)
#define PIN_PTG14                   (PIN_PORTG | PIN14)
#define PIN_PTG15                   (PIN_PORTG | PIN15)
#define PIN_PTG16                   (PIN_PORTG | PIN16)
#define PIN_PTG17                   (PIN_PORTG | PIN17)
#define PIN_PTG18                   (PIN_PORTG | PIN18)
#define PIN_PTG19                   (PIN_PORTG | PIN19)
#define PIN_PTG20                   (PIN_PORTG | PIN20)
#define PIN_PTG21                   (PIN_PORTG | PIN21)
#define PIN_PTG22                   (PIN_PORTG | PIN22)
#define PIN_PTG23                   (PIN_PORTG | PIN23)
#define PIN_PTG24                   (PIN_PORTG | PIN24)
#define PIN_PTG25                   (PIN_PORTG | PIN25)
#define PIN_PTG26                   (PIN_PORTG | PIN26)
#define PIN_PTG27                   (PIN_PORTG | PIN27)

/* QuadSPI */

