apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k344_pinmux.h
#define PIN_QSPI_IOFA0              (PIN_PORTD | PIN11 | PIN_OUTPUT_MODE_ALT7 | PIN_INPUT_ALT1  | IMCR(817))
#define PIN_QSPI_IOFA1              (PIN_PORTD | PIN7  | PIN_OUTPUT_MODE_ALT7 | PIN_INPUT_ALT1  | IMCR(818))
#define PIN_QSPI_IOFA2              (PIN_PORTD | PIN12 | PIN_OUTPUT_MODE_ALT7 | PIN_INPUT_ALT1  | IMCR(819))
#define PIN_QSPI_IOFA3              (PIN_PORTC | PIN2  | PIN_OUTPUT_MODE_ALT7 | PIN_INPUT_ALT1  | IMCR(820))
#define PIN_QSPI_PCSFA              (PIN_PORTC | PIN3  | PIN_OUTPUT_MODE_ALT6)
#define PIN_QSPI_SCKFA              (PIN_PORTD | PIN10 | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT1  | IMCR(821))

/* Reset */

#define PIN_RESET                   (PIN_PORTA | PIN5  | PIN_OUTPUT_ALT7)

/* Synchronous Audio Interface (SAI) */

#define PIN_SAI0_BCLK               (PIN_PORTC | PIN12 | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT1  | IMCR(827))
#define PIN_SAI0_D0                 (PIN_PORTB | PIN2  | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT1  | IMCR(828))
#define PIN_SAI0_D1                 (PIN_PORTB | PIN29 | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT1  | IMCR(829))
#define PIN_SAI0_D2                 (PIN_PORTC | PIN18 | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT1  | IMCR(830))
#define PIN_SAI0_D3                 (PIN_PORTC | PIN19 | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT1  | IMCR(831))
#define PIN_SAI0_MCLK               (PIN_PORTB | PIN3  | PIN_INPUT_ALT1  | IMCR(832))
#define PIN_SAI0_SYNC               (PIN_PORTC | PIN13 | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT1  | IMCR(833))

#define PIN_SAI1_BCLK               (PIN_PORTE | PIN8  | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT1  | IMCR(834))
#define PIN_SAI1_D0                 (PIN_PORTD | PIN13 | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT1  | IMCR(835))
#define PIN_SAI1_MCLK               (PIN_PORTD | PIN14 | PIN_INPUT_ALT1  | IMCR(836))
#define PIN_SAI1_SYNC               (PIN_PORTD | PIN15 | PIN_OUTPUT_ALT6 | PIN_INPUT_ALT1  | IMCR(837))

/* SWD Debug */

#define PIN_SWD_CLK                 (PIN_PORTC | PIN4  | PIN_INPUT_ALT0  | IMCR(696))
#define PIN_SWD_DIO                 (PIN_PORTA | PIN4  | PIN_OUTPUT_ALT7 | PIN_INPUT_ALT0  | IMCR(698))
#define PIN_TRACE_SWO               (PIN_PORTA | PIN10 | PIN_OUTPUT_ALT7)

/* ETM Trace Debug */

#define PIN_TRACE_ETM_CLKOUT_0      (PIN_PORTC | PIN2  | PIN_OUTPUT_ALT6)
#define PIN_TRACE_ETM_CLKOUT_1      (PIN_PORTG | PIN6  | PIN_OUTPUT_ALT7)
#define PIN_TRACE_ETM_D0_0          (PIN_PORTD | PIN7  | PIN_OUTPUT_ALT6)
#define PIN_TRACE_ETM_D0_1          (PIN_PORTG | PIN7  | PIN_OUTPUT_ALT7)
#define PIN_TRACE_ETM_D1_0          (PIN_PORTD | PIN12 | PIN_OUTPUT_ALT4)
#define PIN_TRACE_ETM_D1_1          (PIN_PORTG | PIN15 | PIN_OUTPUT_ALT7)
#define PIN_TRACE_ETM_D2_0          (PIN_PORTD | PIN11 | PIN_OUTPUT_ALT4)
#define PIN_TRACE_ETM_D2_1          (PIN_PORTG | PIN16 | PIN_OUTPUT_ALT7)
#define PIN_TRACE_ETM_D3_0          (PIN_PORTD | PIN10 | PIN_OUTPUT_ALT4)
#define PIN_TRACE_ETM_D3_1          (PIN_PORTF | PIN31 | PIN_OUTPUT_ALT7)
#define PIN_TRACE_ETM_D4            (PIN_PORTG | PIN17 | PIN_OUTPUT_ALT7)
#define PIN_TRACE_ETM_D5            (PIN_PORTF | PIN28 | PIN_OUTPUT_ALT7)
#define PIN_TRACE_ETM_D6            (PIN_PORTG | PIN18 | PIN_OUTPUT_ALT7)
#define PIN_TRACE_ETM_D7            (PIN_PORTG | PIN19 | PIN_OUTPUT_ALT7)
#define PIN_TRACE_ETM_D8            (PIN_PORTG | PIN20 | PIN_OUTPUT_ALT7)
#define PIN_TRACE_ETM_D9            (PIN_PORTG | PIN21 | PIN_OUTPUT_ALT7)
#define PIN_TRACE_ETM_D10           (PIN_PORTG | PIN22 | PIN_OUTPUT_ALT7)
#define PIN_TRACE_ETM_D11           (PIN_PORTG | PIN23 | PIN_OUTPUT_ALT7)
#define PIN_TRACE_ETM_D12           (PIN_PORTG | PIN24 | PIN_OUTPUT_ALT7)
#define PIN_TRACE_ETM_D13           (PIN_PORTG | PIN25 | PIN_OUTPUT_ALT7)
#define PIN_TRACE_ETM_D14           (PIN_PORTG | PIN26 | PIN_OUTPUT_ALT7)
#define PIN_TRACE_ETM_D15           (PIN_PORTG | PIN27 | PIN_OUTPUT_ALT7)

/* Trigger MUX (TRGMUX) */

#define PIN_TRGMUX_IN0              (PIN_PORTB | PIN5  | PIN_INPUT_ALT1  | IMCR(856))
#define PIN_TRGMUX_IN1              (PIN_PORTB | PIN4  | PIN_INPUT_ALT1  | IMCR(857))
#define PIN_TRGMUX_IN2              (PIN_PORTB | PIN3  | PIN_INPUT_ALT1  | IMCR(858))
#define PIN_TRGMUX_IN3              (PIN_PORTB | PIN2  | PIN_INPUT_ALT1  | IMCR(859))
#define PIN_TRGMUX_IN4              (PIN_PORTD | PIN3  | PIN_INPUT_ALT1  | IMCR(860))
#define PIN_TRGMUX_IN5              (PIN_PORTD | PIN2  | PIN_INPUT_ALT1  | IMCR(861))
#define PIN_TRGMUX_IN6              (PIN_PORTE | PIN3  | PIN_INPUT_ALT1  | IMCR(862))
#define PIN_TRGMUX_IN7              (PIN_PORTD | PIN5  | PIN_INPUT_ALT1  | IMCR(863))
#define PIN_TRGMUX_IN8              (PIN_PORTC | PIN15 | PIN_INPUT_ALT1  | IMCR(864))
#define PIN_TRGMUX_IN9              (PIN_PORTC | PIN14 | PIN_INPUT_ALT1  | IMCR(865))
#define PIN_TRGMUX_IN10             (PIN_PORTC | PIN11 | PIN_INPUT_ALT1  | IMCR(866))
#define PIN_TRGMUX_IN11             (PIN_PORTC | PIN10 | PIN_INPUT_ALT1  | IMCR(867))
#define PIN_TRGMUX_IN12             (PIN_PORTA | PIN18 | PIN_INPUT_ALT1  | IMCR(868))
#define PIN_TRGMUX_IN13             (PIN_PORTA | PIN19 | PIN_INPUT_ALT1  | IMCR(869))
#define PIN_TRGMUX_IN14             (PIN_PORTA | PIN20 | PIN_INPUT_ALT1  | IMCR(870))
#define PIN_TRGMUX_IN15             (PIN_PORTA | PIN21 | PIN_INPUT_ALT1  | IMCR(871))
#define PIN_TRGMUX_OUT0             (PIN_PORTA | PIN1  | PIN_OUTPUT_ALT7)
#define PIN_TRGMUX_OUT1             (PIN_PORTD | PIN0  | PIN_OUTPUT_ALT7)
#define PIN_TRGMUX_OUT2             (PIN_PORTD | PIN1  | PIN_OUTPUT_ALT7)
#define PIN_TRGMUX_OUT3             (PIN_PORTA | PIN0  | PIN_OUTPUT_ALT7)
#define PIN_TRGMUX_OUT4             (PIN_PORTE | PIN10 | PIN_OUTPUT_ALT7)
#define PIN_TRGMUX_OUT5             (PIN_PORTE | PIN11 | PIN_OUTPUT_ALT7)
#define PIN_TRGMUX_OUT6             (PIN_PORTE | PIN15 | PIN_OUTPUT_ALT7)
#define PIN_TRGMUX_OUT7             (PIN_PORTE | PIN16 | PIN_OUTPUT_ALT7)
#define PIN_TRGMUX_OUT8             (PIN_PORTA | PIN31 | PIN_OUTPUT_ALT7)
#define PIN_TRGMUX_OUT9             (PIN_PORTB | PIN18 | PIN_OUTPUT_ALT7)
#define PIN_TRGMUX_OUT9             (PIN_PORTB | PIN18 | PIN_OUTPUT_ALT7)
#define PIN_TRGMUX_OUT10            (PIN_PORTB | PIN19 | PIN_OUTPUT_ALT7)
#define PIN_TRGMUX_OUT11            (PIN_PORTB | PIN20 | PIN_OUTPUT_ALT7)
#define PIN_TRGMUX_OUT12            (PIN_PORTB | PIN21 | PIN_OUTPUT_ALT7)
#define PIN_TRGMUX_OUT13            (PIN_PORTB | PIN22 | PIN_OUTPUT_ALT7)
#define PIN_TRGMUX_OUT14            (PIN_PORTB | PIN23 | PIN_OUTPUT_ALT7)
#define PIN_TRGMUX_OUT15            (PIN_PORTC | PIN24 | PIN_OUTPUT_ALT7)

/* Wakeup Unit (WKPU) */

#define PIN_WKPU0                   (PIN_PORTA | PIN2  | PIN_INPUT_WKPU  | WPKU(0))
#define PIN_WKPU1                   (PIN_PORTD | PIN3  | PIN_INPUT_WKPU  | WPKU(1))
#define PIN_WKPU2                   (PIN_PORTC | PIN7  | PIN_INPUT_WKPU  | WPKU(2))
#define PIN_WKPU3                   (PIN_PORTC | PIN6  | PIN_INPUT_WKPU  | WPKU(3))
#define PIN_WKPU4                   (PIN_PORTA | PIN13 | PIN_INPUT_WKPU  | WPKU(4))
#define PIN_WKPU5                   (PIN_PORTA | PIN1  | PIN_INPUT_WKPU  | WPKU(5))
#define PIN_WKPU6                   (PIN_PORTD | PIN0  | PIN_INPUT_WKPU  | WPKU(6))
#define PIN_WKPU7                   (PIN_PORTB | PIN0  | PIN_INPUT_WKPU  | WPKU(7))
#define PIN_WKPU8                   (PIN_PORTB | PIN2  | PIN_INPUT_WKPU  | WPKU(8))
#define PIN_WKPU9                   (PIN_PORTD | PIN2  | PIN_INPUT_WKPU  | WPKU(9))
#define PIN_WKPU10                  (PIN_PORTC | PIN9  | PIN_INPUT_WKPU  | WPKU(10))
#define PIN_WKPU11                  (PIN_PORTB | PIN13 | PIN_INPUT_WKPU  | WPKU(11))
#define PIN_WKPU12                  (PIN_PORTB | PIN12 | PIN_INPUT_WKPU  | WPKU(12))
#define PIN_WKPU13                  (PIN_PORTB | PIN16 | PIN_INPUT_WKPU  | WPKU(13))
#define PIN_WKPU14                  (PIN_PORTB | PIN17 | PIN_INPUT_WKPU  | WPKU(14))
#define PIN_WKPU15                  (PIN_PORTA | PIN6  | PIN_INPUT_WKPU  | WPKU(15))
#define PIN_WKPU16                  (PIN_PORTB | PIN11 | PIN_INPUT_WKPU  | WPKU(16))
#define PIN_WKPU17                  (PIN_PORTB | PIN9  | PIN_INPUT_WKPU  | WPKU(17))
#define PIN_WKPU18                  (PIN_PORTC | PIN11 | PIN_INPUT_WKPU  | WPKU(18))
#define PIN_WKPU19                  (PIN_PORTE | PIN16 | PIN_INPUT_WKPU  | WPKU(19))
#define PIN_WKPU20                  (PIN_PORTA | PIN15 | PIN_INPUT_WKPU  | WPKU(20))
#define PIN_WKPU21                  (PIN_PORTA | PIN9  | PIN_INPUT_WKPU  | WPKU(21))
#define PIN_WKPU22                  (PIN_PORTD | PIN4  | PIN_INPUT_WKPU  | WPKU(22))
#define PIN_WKPU23                  (PIN_PORTA | PIN8  | PIN_INPUT_WKPU  | WPKU(23))
#define PIN_WKPU24                  (PIN_PORTD | PIN13 | PIN_INPUT_WKPU  | WPKU(24))
#define PIN_WKPU25                  (PIN_PORTB | PIN8  | PIN_INPUT_WKPU  | WPKU(25))
#define PIN_WKPU26                  (PIN_PORTE | PIN0  | PIN_INPUT_WKPU  | WPKU(26))
#define PIN_WKPU27                  (PIN_PORTE | PIN2  | PIN_INPUT_WKPU  | WPKU(27))
#define PIN_WKPU28                  (PIN_PORTE | PIN11 | PIN_INPUT_WKPU  | WPKU(28))
#define PIN_WKPU29                  (PIN_PORTE | PIN6  | PIN_INPUT_WKPU  | WPKU(29))
#define PIN_WKPU30                  (PIN_PORTE | PIN14 | PIN_INPUT_WKPU  | WPKU(30))
#define PIN_WKPU31                  (PIN_PORTA | PIN16 | PIN_INPUT_WKPU  | WPKU(31))
#define PIN_WKPU32                  (PIN_PORTE | PIN5  | PIN_INPUT_WKPU  | WPKU(32))
#define PIN_WKPU33                  (PIN_PORTB | PIN15 | PIN_INPUT_WKPU  | WPKU(33))
#define PIN_WKPU34                  (PIN_PORTA | PIN25 | PIN_INPUT_WKPU  | WPKU(34))
#define PIN_WKPU35                  (PIN_PORTA | PIN26 | PIN_INPUT_WKPU  | WPKU(35))
#define PIN_WKPU36                  (PIN_PORTC | PIN18 | PIN_INPUT_WKPU  | WPKU(36))
#define PIN_WKPU37                  (PIN_PORTA | PIN30 | PIN_INPUT_WKPU  | WPKU(37))
#define PIN_WKPU38                  (PIN_PORTB | PIN19 | PIN_INPUT_WKPU  | WPKU(38))
#define PIN_WKPU39                  (PIN_PORTB | PIN21 | PIN_INPUT_WKPU  | WPKU(39))
#define PIN_WKPU40                  (PIN_PORTB | PIN23 | PIN_INPUT_WKPU  | WPKU(40))
#define PIN_WKPU41                  (PIN_PORTB | PIN26 | PIN_INPUT_WKPU  | WPKU(41))
#define PIN_WKPU42                  (PIN_PORTB | PIN28 | PIN_INPUT_WKPU  | WPKU(42))
#define PIN_WKPU43                  (PIN_PORTC | PIN20 | PIN_INPUT_WKPU  | WPKU(43))
#define PIN_WKPU44                  (PIN_PORTC | PIN23 | PIN_INPUT_WKPU  | WPKU(44))
#define PIN_WKPU45                  (PIN_PORTC | PIN25 | PIN_INPUT_WKPU  | WPKU(45))
#define PIN_WKPU46                  (PIN_PORTC | PIN24 | PIN_INPUT_WKPU  | WPKU(46))
#define PIN_WKPU47                  (PIN_PORTC | PIN29 | PIN_INPUT_WKPU  | WPKU(47))
#define PIN_WKPU48                  (PIN_PORTC | PIN26 | PIN_INPUT_WKPU  | WPKU(48))
#define PIN_WKPU49                  (PIN_PORTC | PIN31 | PIN_INPUT_WKPU  | WPKU(49))
#define PIN_WKPU50                  (PIN_PORTD | PIN23 | PIN_INPUT_WKPU  | WPKU(50))
#define PIN_WKPU51                  (PIN_PORTD | PIN27 | PIN_INPUT_WKPU  | WPKU(51))
#define PIN_WKPU52                  (PIN_PORTD | PIN29 | PIN_INPUT_WKPU  | WPKU(52))
#define PIN_WKPU53                  (PIN_PORTD | PIN31 | PIN_INPUT_WKPU  | WPKU(53))
#define PIN_WKPU54                  (PIN_PORTD | PIN20 | PIN_INPUT_WKPU  | WPKU(54))
#define PIN_WKPU55                  (PIN_PORTE | PIN18 | PIN_INPUT_WKPU  | WPKU(55))
#define PIN_WKPU56                  (PIN_PORTE | PIN21 | PIN_INPUT_WKPU  | WPKU(56))
#define PIN_WKPU57                  (PIN_PORTE | PIN23 | PIN_INPUT_WKPU  | WPKU(57))
#define PIN_WKPU58                  (PIN_PORTE | PIN25 | PIN_INPUT_WKPU  | WPKU(58))
#define PIN_WKPU59                  (PIN_PORTA | PIN20 | PIN_INPUT_WKPU  | WPKU(59))

#endif /* __ARCH_ARM_SRC_S32K3XX_HARDWARE_S32K344_PINMUX_H */
